GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 0DFDh
// bitfield definitions
T2INPPS_PIN_POSN                         equ 0000h
T2INPPS_PIN_POSITION                     equ 0000h
T2INPPS_PIN_SIZE                         equ 0003h
T2INPPS_PIN_LENGTH                       equ 0003h
T2INPPS_PIN_MASK                         equ 0007h
T2INPPS_PORT_POSN                        equ 0003h
T2INPPS_PORT_POSITION                    equ 0003h
T2INPPS_PORT_SIZE                        equ 0002h
T2INPPS_PORT_LENGTH                      equ 0002h
T2INPPS_PORT_MASK                        equ 0018h
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0006h
T2INPPS_T2INPPS_LENGTH                   equ 0006h
T2INPPS_T2INPPS_MASK                     equ 003Fh
T2INPPS_T2INPPS0_POSN                    equ 0000h
T2INPPS_T2INPPS0_POSITION                equ 0000h
T2INPPS_T2INPPS0_SIZE                    equ 0001h
T2INPPS_T2INPPS0_LENGTH                  equ 0001h
T2INPPS_T2INPPS0_MASK                    equ 0001h
T2INPPS_T2INPPS1_POSN                    equ 0001h
T2INPPS_T2INPPS1_POSITION                equ 0001h
T2INPPS_T2INPPS1_SIZE                    equ 0001h
T2INPPS_T2INPPS1_LENGTH                  equ 0001h
T2INPPS_T2INPPS1_MASK                    equ 0002h
T2INPPS_T2INPPS2_POSN                    equ 0002h
T2INPPS_T2INPPS2_POSITION                equ 0002h
T2INPPS_T2INPPS2_SIZE                    equ 0001h
T2INPPS_T2INPPS2_LENGTH                  equ 0001h
T2INPPS_T2INPPS2_MASK                    equ 0004h
T2INPPS_T2INPPS3_POSN                    equ 0003h
T2INPPS_T2INPPS3_POSITION                equ 0003h
T2INPPS_T2INPPS3_SIZE                    equ 0001h
T2INPPS_T2INPPS3_LENGTH                  equ 0001h
T2INPPS_T2INPPS3_MASK                    equ 0008h
T2INPPS_T2INPPS4_POSN                    equ 0004h
T2INPPS_T2INPPS4_POSITION                equ 0004h
T2INPPS_T2INPPS4_SIZE                    equ 0001h
T2INPPS_T2INPPS4_LENGTH                  equ 0001h
T2INPPS_T2INPPS4_MASK                    equ 0010h

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 0DFEh
// bitfield definitions
T4INPPS_PIN_POSN                         equ 0000h
T4INPPS_PIN_POSITION                     equ 0000h
T4INPPS_PIN_SIZE                         equ 0003h
T4INPPS_PIN_LENGTH                       equ 0003h
T4INPPS_PIN_MASK                         equ 0007h
T4INPPS_PORT_POSN                        equ 0003h
T4INPPS_PORT_POSITION                    equ 0003h
T4INPPS_PORT_SIZE                        equ 0003h
T4INPPS_PORT_LENGTH                      equ 0003h
T4INPPS_PORT_MASK                        equ 0038h
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0006h
T4INPPS_T4INPPS_LENGTH                   equ 0006h
T4INPPS_T4INPPS_MASK                     equ 003Fh
T4INPPS_T4INPPS0_POSN                    equ 0000h
T4INPPS_T4INPPS0_POSITION                equ 0000h
T4INPPS_T4INPPS0_SIZE                    equ 0001h
T4INPPS_T4INPPS0_LENGTH                  equ 0001h
T4INPPS_T4INPPS0_MASK                    equ 0001h
T4INPPS_T4INPPS1_POSN                    equ 0001h
T4INPPS_T4INPPS1_POSITION                equ 0001h
T4INPPS_T4INPPS1_SIZE                    equ 0001h
T4INPPS_T4INPPS1_LENGTH                  equ 0001h
T4INPPS_T4INPPS1_MASK                    equ 0002h
T4INPPS_T4INPPS2_POSN                    equ 0002h
T4INPPS_T4INPPS2_POSITION                equ 0002h
T4INPPS_T4INPPS2_SIZE                    equ 0001h
T4INPPS_T4INPPS2_LENGTH                  equ 0001h
T4INPPS_T4INPPS2_MASK                    equ 0004h
T4INPPS_T4INPPS3_POSN                    equ 0003h
T4INPPS_T4INPPS3_POSITION                equ 0003h
T4INPPS_T4INPPS3_SIZE                    equ 0001h
T4INPPS_T4INPPS3_LENGTH                  equ 0001h
T4INPPS_T4INPPS3_MASK                    equ 0008h
T4INPPS_T4INPPS4_POSN                    equ 0004h
T4INPPS_T4INPPS4_POSITION                equ 0004h
T4INPPS_T4INPPS4_SIZE                    equ 0001h
T4INPPS_T4INPPS4_LENGTH                  equ 0001h
T4INPPS_T4INPPS4_MASK                    equ 0010h
T4INPPS_T4INPPS5_POSN                    equ 0005h
T4INPPS_T4INPPS5_POSITION                equ 0005h
T4INPPS_T4INPPS5_SIZE                    equ 0001h
T4INPPS_T4INPPS5_LENGTH                  equ 0001h
T4INPPS_T4INPPS5_MASK                    equ 0020h

// Register: T6INPPS
#define T6INPPS T6INPPS
T6INPPS                                  equ 0DFFh
// bitfield definitions
T6INPPS_PIN_POSN                         equ 0000h
T6INPPS_PIN_POSITION                     equ 0000h
T6INPPS_PIN_SIZE                         equ 0003h
T6INPPS_PIN_LENGTH                       equ 0003h
T6INPPS_PIN_MASK                         equ 0007h
T6INPPS_PORT_POSN                        equ 0003h
T6INPPS_PORT_POSITION                    equ 0003h
T6INPPS_PORT_SIZE                        equ 0002h
T6INPPS_PORT_LENGTH                      equ 0002h
T6INPPS_PORT_MASK                        equ 0018h
T6INPPS_T6INPPS_POSN                     equ 0000h
T6INPPS_T6INPPS_POSITION                 equ 0000h
T6INPPS_T6INPPS_SIZE                     equ 0006h
T6INPPS_T6INPPS_LENGTH                   equ 0006h
T6INPPS_T6INPPS_MASK                     equ 003Fh
T6INPPS_T6INPPS0_POSN                    equ 0000h
T6INPPS_T6INPPS0_POSITION                equ 0000h
T6INPPS_T6INPPS0_SIZE                    equ 0001h
T6INPPS_T6INPPS0_LENGTH                  equ 0001h
T6INPPS_T6INPPS0_MASK                    equ 0001h
T6INPPS_T6INPPS1_POSN                    equ 0001h
T6INPPS_T6INPPS1_POSITION                equ 0001h
T6INPPS_T6INPPS1_SIZE                    equ 0001h
T6INPPS_T6INPPS1_LENGTH                  equ 0001h
T6INPPS_T6INPPS1_MASK                    equ 0002h
T6INPPS_T6INPPS2_POSN                    equ 0002h
T6INPPS_T6INPPS2_POSITION                equ 0002h
T6INPPS_T6INPPS2_SIZE                    equ 0001h
T6INPPS_T6INPPS2_LENGTH                  equ 0001h
T6INPPS_T6INPPS2_MASK                    equ 0004h
T6INPPS_T6INPPS3_POSN                    equ 0003h
T6INPPS_T6INPPS3_POSITION                equ 0003h
T6INPPS_T6INPPS3_SIZE                    equ 0001h
T6INPPS_T6INPPS3_LENGTH                  equ 0001h
T6INPPS_T6INPPS3_MASK                    equ 0008h
T6INPPS_T6INPPS4_POSN                    equ 0004h
T6INPPS_T6INPPS4_POSITION                equ 0004h
T6INPPS_T6INPPS4_SIZE                    equ 0001h
T6INPPS_T6INPPS4_LENGTH                  equ 0001h
T6INPPS_T6INPPS4_MASK                    equ 0010h

// Register: T8INPPS
#define T8INPPS T8INPPS
T8INPPS                                  equ 0E00h
// bitfield definitions
T8INPPS_PIN_POSN                         equ 0000h
T8INPPS_PIN_POSITION                     equ 0000h
T8INPPS_PIN_SIZE                         equ 0003h
T8INPPS_PIN_LENGTH                       equ 0003h
T8INPPS_PIN_MASK                         equ 0007h
T8INPPS_PORT_POSN                        equ 0003h
T8INPPS_PORT_POSITION                    equ 0003h
T8INPPS_PORT_SIZE                        equ 0003h
T8INPPS_PORT_LENGTH                      equ 0003h
T8INPPS_PORT_MASK                        equ 0038h
T8INPPS_T8INPPS_POSN                     equ 0000h
T8INPPS_T8INPPS_POSITION                 equ 0000h
T8INPPS_T8INPPS_SIZE                     equ 0006h
T8INPPS_T8INPPS_LENGTH                   equ 0006h
T8INPPS_T8INPPS_MASK                     equ 003Fh
T8INPPS_T8INPPS0_POSN                    equ 0000h
T8INPPS_T8INPPS0_POSITION                equ 0000h
T8INPPS_T8INPPS0_SIZE                    equ 0001h
T8INPPS_T8INPPS0_LENGTH                  equ 0001h
T8INPPS_T8INPPS0_MASK                    equ 0001h
T8INPPS_T8INPPS1_POSN                    equ 0001h
T8INPPS_T8INPPS1_POSITION                equ 0001h
T8INPPS_T8INPPS1_SIZE                    equ 0001h
T8INPPS_T8INPPS1_LENGTH                  equ 0001h
T8INPPS_T8INPPS1_MASK                    equ 0002h
T8INPPS_T8INPPS2_POSN                    equ 0002h
T8INPPS_T8INPPS2_POSITION                equ 0002h
T8INPPS_T8INPPS2_SIZE                    equ 0001h
T8INPPS_T8INPPS2_LENGTH                  equ 0001h
T8INPPS_T8INPPS2_MASK                    equ 0004h
T8INPPS_T8INPPS3_POSN                    equ 0003h
T8INPPS_T8INPPS3_POSITION                equ 0003h
T8INPPS_T8INPPS3_SIZE                    equ 0001h
T8INPPS_T8INPPS3_LENGTH                  equ 0001h
T8INPPS_T8INPPS3_MASK                    equ 0008h
T8INPPS_T8INPPS4_POSN                    equ 0004h
T8INPPS_T8INPPS4_POSITION                equ 0004h
T8INPPS_T8INPPS4_SIZE                    equ 0001h
T8INPPS_T8INPPS4_LENGTH                  equ 0001h
T8INPPS_T8INPPS4_MASK                    equ 0010h
T8INPPS_T8INPPS5_POSN                    equ 0005h
T8INPPS_T8INPPS5_POSITION                equ 0005h
T8INPPS_T8INPPS5_SIZE                    equ 0001h
T8INPPS_T8INPPS5_LENGTH                  equ 0001h
T8INPPS_T8INPPS5_MASK                    equ 0020h

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
ADACTPPS                                 equ 0E01h
// bitfield definitions
ADACTPPS_PIN_POSN                        equ 0000h
ADACTPPS_PIN_POSITION                    equ 0000h
ADACTPPS_PIN_SIZE                        equ 0003h
ADACTPPS_PIN_LENGTH                      equ 0003h
ADACTPPS_PIN_MASK                        equ 0007h
ADACTPPS_PORT_POSN                       equ 0003h
ADACTPPS_PORT_POSITION                   equ 0003h
ADACTPPS_PORT_SIZE                       equ 0003h
ADACTPPS_PORT_LENGTH                     equ 0003h
ADACTPPS_PORT_MASK                       equ 0038h
ADACTPPS_ADACTPPS_POSN                   equ 0000h
ADACTPPS_ADACTPPS_POSITION               equ 0000h
ADACTPPS_ADACTPPS_SIZE                   equ 0006h
ADACTPPS_ADACTPPS_LENGTH                 equ 0006h
ADACTPPS_ADACTPPS_MASK                   equ 003Fh
ADACTPPS_ADACTPPS0_POSN                  equ 0000h
ADACTPPS_ADACTPPS0_POSITION              equ 0000h
ADACTPPS_ADACTPPS0_SIZE                  equ 0001h
ADACTPPS_ADACTPPS0_LENGTH                equ 0001h
ADACTPPS_ADACTPPS0_MASK                  equ 0001h
ADACTPPS_ADACTPPS1_POSN                  equ 0001h
ADACTPPS_ADACTPPS1_POSITION              equ 0001h
ADACTPPS_ADACTPPS1_SIZE                  equ 0001h
ADACTPPS_ADACTPPS1_LENGTH                equ 0001h
ADACTPPS_ADACTPPS1_MASK                  equ 0002h
ADACTPPS_ADACTPPS2_POSN                  equ 0002h
ADACTPPS_ADACTPPS2_POSITION              equ 0002h
ADACTPPS_ADACTPPS2_SIZE                  equ 0001h
ADACTPPS_ADACTPPS2_LENGTH                equ 0001h
ADACTPPS_ADACTPPS2_MASK                  equ 0004h
ADACTPPS_ADACTPPS3_POSN                  equ 0003h
ADACTPPS_ADACTPPS3_POSITION              equ 0003h
ADACTPPS_ADACTPPS3_SIZE                  equ 0001h
ADACTPPS_ADACTPPS3_LENGTH                equ 0001h
ADACTPPS_ADACTPPS3_MASK                  equ 0008h
ADACTPPS_ADACTPPS4_POSN                  equ 0004h
ADACTPPS_ADACTPPS4_POSITION              equ 0004h
ADACTPPS_ADACTPPS4_SIZE                  equ 0001h
ADACTPPS_ADACTPPS4_LENGTH                equ 0001h
ADACTPPS_ADACTPPS4_MASK                  equ 0010h
ADACTPPS_ADACTPPS5_POSN                  equ 0005h
ADACTPPS_ADACTPPS5_POSITION              equ 0005h
ADACTPPS_ADACTPPS5_SIZE                  equ 0001h
ADACTPPS_ADACTPPS5_LENGTH                equ 0001h
ADACTPPS_ADACTPPS5_MASK                  equ 0020h

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 0E02h
// bitfield definitions
CCP1PPS_PIN_POSN                         equ 0000h
CCP1PPS_PIN_POSITION                     equ 0000h
CCP1PPS_PIN_SIZE                         equ 0003h
CCP1PPS_PIN_LENGTH                       equ 0003h
CCP1PPS_PIN_MASK                         equ 0007h
CCP1PPS_PORT_POSN                        equ 0003h
CCP1PPS_PORT_POSITION                    equ 0003h
CCP1PPS_PORT_SIZE                        equ 0003h
CCP1PPS_PORT_LENGTH                      equ 0003h
CCP1PPS_PORT_MASK                        equ 0038h
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0006h
CCP1PPS_CCP1PPS_LENGTH                   equ 0006h
CCP1PPS_CCP1PPS_MASK                     equ 003Fh
CCP1PPS_CCP1PPS0_POSN                    equ 0000h
CCP1PPS_CCP1PPS0_POSITION                equ 0000h
CCP1PPS_CCP1PPS0_SIZE                    equ 0001h
CCP1PPS_CCP1PPS0_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS0_MASK                    equ 0001h
CCP1PPS_CCP1PPS1_POSN                    equ 0001h
CCP1PPS_CCP1PPS1_POSITION                equ 0001h
CCP1PPS_CCP1PPS1_SIZE                    equ 0001h
CCP1PPS_CCP1PPS1_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS1_MASK                    equ 0002h
CCP1PPS_CCP1PPS2_POSN                    equ 0002h
CCP1PPS_CCP1PPS2_POSITION                equ 0002h
CCP1PPS_CCP1PPS2_SIZE                    equ 0001h
CCP1PPS_CCP1PPS2_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS2_MASK                    equ 0004h
CCP1PPS_CCP1PPS3_POSN                    equ 0003h
CCP1PPS_CCP1PPS3_POSITION                equ 0003h
CCP1PPS_CCP1PPS3_SIZE                    equ 0001h
CCP1PPS_CCP1PPS3_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS3_MASK                    equ 0008h
CCP1PPS_CCP1PPS4_POSN                    equ 0004h
CCP1PPS_CCP1PPS4_POSITION                equ 0004h
CCP1PPS_CCP1PPS4_SIZE                    equ 0001h
CCP1PPS_CCP1PPS4_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS4_MASK                    equ 0010h
CCP1PPS_CCP1PPS5_POSN                    equ 0005h
CCP1PPS_CCP1PPS5_POSITION                equ 0005h
CCP1PPS_CCP1PPS5_SIZE                    equ 0001h
CCP1PPS_CCP1PPS5_LENGTH                  equ 0001h
CCP1PPS_CCP1PPS5_MASK                    equ 0020h

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 0E03h
// bitfield definitions
CCP2PPS_PIN_POSN                         equ 0000h
CCP2PPS_PIN_POSITION                     equ 0000h
CCP2PPS_PIN_SIZE                         equ 0003h
CCP2PPS_PIN_LENGTH                       equ 0003h
CCP2PPS_PIN_MASK                         equ 0007h
CCP2PPS_PORT_POSN                        equ 0003h
CCP2PPS_PORT_POSITION                    equ 0003h
CCP2PPS_PORT_SIZE                        equ 0003h
CCP2PPS_PORT_LENGTH                      equ 0003h
CCP2PPS_PORT_MASK                        equ 0038h
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0006h
CCP2PPS_CCP2PPS_LENGTH                   equ 0006h
CCP2PPS_CCP2PPS_MASK                     equ 003Fh
CCP2PPS_CCP2PPS0_POSN                    equ 0000h
CCP2PPS_CCP2PPS0_POSITION                equ 0000h
CCP2PPS_CCP2PPS0_SIZE                    equ 0001h
CCP2PPS_CCP2PPS0_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS0_MASK                    equ 0001h
CCP2PPS_CCP2PPS1_POSN                    equ 0001h
CCP2PPS_CCP2PPS1_POSITION                equ 0001h
CCP2PPS_CCP2PPS1_SIZE                    equ 0001h
CCP2PPS_CCP2PPS1_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS1_MASK                    equ 0002h
CCP2PPS_CCP2PPS2_POSN                    equ 0002h
CCP2PPS_CCP2PPS2_POSITION                equ 0002h
CCP2PPS_CCP2PPS2_SIZE                    equ 0001h
CCP2PPS_CCP2PPS2_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS2_MASK                    equ 0004h
CCP2PPS_CCP2PPS3_POSN                    equ 0003h
CCP2PPS_CCP2PPS3_POSITION                equ 0003h
CCP2PPS_CCP2PPS3_SIZE                    equ 0001h
CCP2PPS_CCP2PPS3_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS3_MASK                    equ 0008h
CCP2PPS_CCP2PPS4_POSN                    equ 0004h
CCP2PPS_CCP2PPS4_POSITION                equ 0004h
CCP2PPS_CCP2PPS4_SIZE                    equ 0001h
CCP2PPS_CCP2PPS4_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS4_MASK                    equ 0010h
CCP2PPS_CCP2PPS5_POSN                    equ 0005h
CCP2PPS_CCP2PPS5_POSITION                equ 0005h
CCP2PPS_CCP2PPS5_SIZE                    equ 0001h
CCP2PPS_CCP2PPS5_LENGTH                  equ 0001h
CCP2PPS_CCP2PPS5_MASK                    equ 0020h

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
CCP3PPS                                  equ 0E04h
// bitfield definitions
CCP3PPS_PIN_POSN                         equ 0000h
CCP3PPS_PIN_POSITION                     equ 0000h
CCP3PPS_PIN_SIZE                         equ 0003h
CCP3PPS_PIN_LENGTH                       equ 0003h
CCP3PPS_PIN_MASK                         equ 0007h
CCP3PPS_PORT_POSN                        equ 0003h
CCP3PPS_PORT_POSITION                    equ 0003h
CCP3PPS_PORT_SIZE                        equ 0003h
CCP3PPS_PORT_LENGTH                      equ 0003h
CCP3PPS_PORT_MASK                        equ 0038h
CCP3PPS_CCP3PPS_POSN                     equ 0000h
CCP3PPS_CCP3PPS_POSITION                 equ 0000h
CCP3PPS_CCP3PPS_SIZE                     equ 0006h
CCP3PPS_CCP3PPS_LENGTH                   equ 0006h
CCP3PPS_CCP3PPS_MASK                     equ 003Fh
CCP3PPS_CCP3PPS0_POSN                    equ 0000h
CCP3PPS_CCP3PPS0_POSITION                equ 0000h
CCP3PPS_CCP3PPS0_SIZE                    equ 0001h
CCP3PPS_CCP3PPS0_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS0_MASK                    equ 0001h
CCP3PPS_CCP3PPS1_POSN                    equ 0001h
CCP3PPS_CCP3PPS1_POSITION                equ 0001h
CCP3PPS_CCP3PPS1_SIZE                    equ 0001h
CCP3PPS_CCP3PPS1_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS1_MASK                    equ 0002h
CCP3PPS_CCP3PPS2_POSN                    equ 0002h
CCP3PPS_CCP3PPS2_POSITION                equ 0002h
CCP3PPS_CCP3PPS2_SIZE                    equ 0001h
CCP3PPS_CCP3PPS2_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS2_MASK                    equ 0004h
CCP3PPS_CCP3PPS3_POSN                    equ 0003h
CCP3PPS_CCP3PPS3_POSITION                equ 0003h
CCP3PPS_CCP3PPS3_SIZE                    equ 0001h
CCP3PPS_CCP3PPS3_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS3_MASK                    equ 0008h
CCP3PPS_CCP3PPS4_POSN                    equ 0004h
CCP3PPS_CCP3PPS4_POSITION                equ 0004h
CCP3PPS_CCP3PPS4_SIZE                    equ 0001h
CCP3PPS_CCP3PPS4_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS4_MASK                    equ 0010h
CCP3PPS_CCP3PPS5_POSN                    equ 0005h
CCP3PPS_CCP3PPS5_POSITION                equ 0005h
CCP3PPS_CCP3PPS5_SIZE                    equ 0001h
CCP3PPS_CCP3PPS5_LENGTH                  equ 0001h
CCP3PPS_CCP3PPS5_MASK                    equ 0020h

// Register: CCP4PPS
#define CCP4PPS CCP4PPS
CCP4PPS                                  equ 0E05h
// bitfield definitions
CCP4PPS_PIN_POSN                         equ 0000h
CCP4PPS_PIN_POSITION                     equ 0000h
CCP4PPS_PIN_SIZE                         equ 0003h
CCP4PPS_PIN_LENGTH                       equ 0003h
CCP4PPS_PIN_MASK                         equ 0007h
CCP4PPS_PORT_POSN                        equ 0003h
CCP4PPS_PORT_POSITION                    equ 0003h
CCP4PPS_PORT_SIZE                        equ 0003h
CCP4PPS_PORT_LENGTH                      equ 0003h
CCP4PPS_PORT_MASK                        equ 0038h
CCP4PPS_CCP4PPS_POSN                     equ 0000h
CCP4PPS_CCP4PPS_POSITION                 equ 0000h
CCP4PPS_CCP4PPS_SIZE                     equ 0006h
CCP4PPS_CCP4PPS_LENGTH                   equ 0006h
CCP4PPS_CCP4PPS_MASK                     equ 003Fh
CCP4PPS_CCP4PPS0_POSN                    equ 0000h
CCP4PPS_CCP4PPS0_POSITION                equ 0000h
CCP4PPS_CCP4PPS0_SIZE                    equ 0001h
CCP4PPS_CCP4PPS0_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS0_MASK                    equ 0001h
CCP4PPS_CCP4PPS1_POSN                    equ 0001h
CCP4PPS_CCP4PPS1_POSITION                equ 0001h
CCP4PPS_CCP4PPS1_SIZE                    equ 0001h
CCP4PPS_CCP4PPS1_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS1_MASK                    equ 0002h
CCP4PPS_CCP4PPS2_POSN                    equ 0002h
CCP4PPS_CCP4PPS2_POSITION                equ 0002h
CCP4PPS_CCP4PPS2_SIZE                    equ 0001h
CCP4PPS_CCP4PPS2_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS2_MASK                    equ 0004h
CCP4PPS_CCP4PPS3_POSN                    equ 0003h
CCP4PPS_CCP4PPS3_POSITION                equ 0003h
CCP4PPS_CCP4PPS3_SIZE                    equ 0001h
CCP4PPS_CCP4PPS3_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS3_MASK                    equ 0008h
CCP4PPS_CCP4PPS4_POSN                    equ 0004h
CCP4PPS_CCP4PPS4_POSITION                equ 0004h
CCP4PPS_CCP4PPS4_SIZE                    equ 0001h
CCP4PPS_CCP4PPS4_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS4_MASK                    equ 0010h
CCP4PPS_CCP4PPS5_POSN                    equ 0005h
CCP4PPS_CCP4PPS5_POSITION                equ 0005h
CCP4PPS_CCP4PPS5_SIZE                    equ 0001h
CCP4PPS_CCP4PPS5_LENGTH                  equ 0001h
CCP4PPS_CCP4PPS5_MASK                    equ 0020h

// Register: CCP5PPS
#define CCP5PPS CCP5PPS
CCP5PPS                                  equ 0E06h
// bitfield definitions
CCP5PPS_PIN_POSN                         equ 0000h
CCP5PPS_PIN_POSITION                     equ 0000h
CCP5PPS_PIN_SIZE                         equ 0003h
CCP5PPS_PIN_LENGTH                       equ 0003h
CCP5PPS_PIN_MASK                         equ 0007h
CCP5PPS_PORT_POSN                        equ 0003h
CCP5PPS_PORT_POSITION                    equ 0003h
CCP5PPS_PORT_SIZE                        equ 0003h
CCP5PPS_PORT_LENGTH                      equ 0003h
CCP5PPS_PORT_MASK                        equ 0038h
CCP5PPS_CCP5PPS_POSN                     equ 0000h
CCP5PPS_CCP5PPS_POSITION                 equ 0000h
CCP5PPS_CCP5PPS_SIZE                     equ 0006h
CCP5PPS_CCP5PPS_LENGTH                   equ 0006h
CCP5PPS_CCP5PPS_MASK                     equ 003Fh
CCP5PPS_CCP5PPS0_POSN                    equ 0000h
CCP5PPS_CCP5PPS0_POSITION                equ 0000h
CCP5PPS_CCP5PPS0_SIZE                    equ 0001h
CCP5PPS_CCP5PPS0_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS0_MASK                    equ 0001h
CCP5PPS_CCP5PPS1_POSN                    equ 0001h
CCP5PPS_CCP5PPS1_POSITION                equ 0001h
CCP5PPS_CCP5PPS1_SIZE                    equ 0001h
CCP5PPS_CCP5PPS1_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS1_MASK                    equ 0002h
CCP5PPS_CCP5PPS2_POSN                    equ 0002h
CCP5PPS_CCP5PPS2_POSITION                equ 0002h
CCP5PPS_CCP5PPS2_SIZE                    equ 0001h
CCP5PPS_CCP5PPS2_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS2_MASK                    equ 0004h
CCP5PPS_CCP5PPS3_POSN                    equ 0003h
CCP5PPS_CCP5PPS3_POSITION                equ 0003h
CCP5PPS_CCP5PPS3_SIZE                    equ 0001h
CCP5PPS_CCP5PPS3_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS3_MASK                    equ 0008h
CCP5PPS_CCP5PPS4_POSN                    equ 0004h
CCP5PPS_CCP5PPS4_POSITION                equ 0004h
CCP5PPS_CCP5PPS4_SIZE                    equ 0001h
CCP5PPS_CCP5PPS4_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS4_MASK                    equ 0010h
CCP5PPS_CCP5PPS5_POSN                    equ 0005h
CCP5PPS_CCP5PPS5_POSITION                equ 0005h
CCP5PPS_CCP5PPS5_SIZE                    equ 0001h
CCP5PPS_CCP5PPS5_LENGTH                  equ 0001h
CCP5PPS_CCP5PPS5_MASK                    equ 0020h

