GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
SSP1CLKPPS                               equ 0E19h
// bitfield definitions
SSP1CLKPPS_PIN_POSN                      equ 0000h
SSP1CLKPPS_PIN_POSITION                  equ 0000h
SSP1CLKPPS_PIN_SIZE                      equ 0003h
SSP1CLKPPS_PIN_LENGTH                    equ 0003h
SSP1CLKPPS_PIN_MASK                      equ 0007h
SSP1CLKPPS_PORT_POSN                     equ 0003h
SSP1CLKPPS_PORT_POSITION                 equ 0003h
SSP1CLKPPS_PORT_SIZE                     equ 0002h
SSP1CLKPPS_PORT_LENGTH                   equ 0002h
SSP1CLKPPS_PORT_MASK                     equ 0018h
SSP1CLKPPS_SSP1CLKPPS_POSN               equ 0000h
SSP1CLKPPS_SSP1CLKPPS_POSITION           equ 0000h
SSP1CLKPPS_SSP1CLKPPS_SIZE               equ 0006h
SSP1CLKPPS_SSP1CLKPPS_LENGTH             equ 0006h
SSP1CLKPPS_SSP1CLKPPS_MASK               equ 003Fh
SSP1CLKPPS_SSP1CLKPPS0_POSN              equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_POSITION          equ 0000h
SSP1CLKPPS_SSP1CLKPPS0_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS0_MASK              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSN              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_POSITION          equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS1_MASK              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSN              equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_POSITION          equ 0002h
SSP1CLKPPS_SSP1CLKPPS2_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS2_MASK              equ 0004h
SSP1CLKPPS_SSP1CLKPPS3_POSN              equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_POSITION          equ 0003h
SSP1CLKPPS_SSP1CLKPPS3_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS3_MASK              equ 0008h
SSP1CLKPPS_SSP1CLKPPS4_POSN              equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_POSITION          equ 0004h
SSP1CLKPPS_SSP1CLKPPS4_SIZE              equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_LENGTH            equ 0001h
SSP1CLKPPS_SSP1CLKPPS4_MASK              equ 0010h

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
SSP1DATPPS                               equ 0E1Ah
// bitfield definitions
SSP1DATPPS_PIN_POSN                      equ 0000h
SSP1DATPPS_PIN_POSITION                  equ 0000h
SSP1DATPPS_PIN_SIZE                      equ 0003h
SSP1DATPPS_PIN_LENGTH                    equ 0003h
SSP1DATPPS_PIN_MASK                      equ 0007h
SSP1DATPPS_PORT_POSN                     equ 0003h
SSP1DATPPS_PORT_POSITION                 equ 0003h
SSP1DATPPS_PORT_SIZE                     equ 0002h
SSP1DATPPS_PORT_LENGTH                   equ 0002h
SSP1DATPPS_PORT_MASK                     equ 0018h
SSP1DATPPS_SSP1DATPPS_POSN               equ 0000h
SSP1DATPPS_SSP1DATPPS_POSITION           equ 0000h
SSP1DATPPS_SSP1DATPPS_SIZE               equ 0006h
SSP1DATPPS_SSP1DATPPS_LENGTH             equ 0006h
SSP1DATPPS_SSP1DATPPS_MASK               equ 003Fh
SSP1DATPPS_SSP1DATPPS0_POSN              equ 0000h
SSP1DATPPS_SSP1DATPPS0_POSITION          equ 0000h
SSP1DATPPS_SSP1DATPPS0_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS0_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS0_MASK              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSN              equ 0001h
SSP1DATPPS_SSP1DATPPS1_POSITION          equ 0001h
SSP1DATPPS_SSP1DATPPS1_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS1_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS1_MASK              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSN              equ 0002h
SSP1DATPPS_SSP1DATPPS2_POSITION          equ 0002h
SSP1DATPPS_SSP1DATPPS2_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS2_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS2_MASK              equ 0004h
SSP1DATPPS_SSP1DATPPS3_POSN              equ 0003h
SSP1DATPPS_SSP1DATPPS3_POSITION          equ 0003h
SSP1DATPPS_SSP1DATPPS3_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS3_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS3_MASK              equ 0008h
SSP1DATPPS_SSP1DATPPS4_POSN              equ 0004h
SSP1DATPPS_SSP1DATPPS4_POSITION          equ 0004h
SSP1DATPPS_SSP1DATPPS4_SIZE              equ 0001h
SSP1DATPPS_SSP1DATPPS4_LENGTH            equ 0001h
SSP1DATPPS_SSP1DATPPS4_MASK              equ 0010h

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
SSP1SSPPS                                equ 0E1Bh
// bitfield definitions
SSP1SSPPS_PIN_POSN                       equ 0000h
SSP1SSPPS_PIN_POSITION                   equ 0000h
SSP1SSPPS_PIN_SIZE                       equ 0003h
SSP1SSPPS_PIN_LENGTH                     equ 0003h
SSP1SSPPS_PIN_MASK                       equ 0007h
SSP1SSPPS_PORT_POSN                      equ 0003h
SSP1SSPPS_PORT_POSITION                  equ 0003h
SSP1SSPPS_PORT_SIZE                      equ 0003h
SSP1SSPPS_PORT_LENGTH                    equ 0003h
SSP1SSPPS_PORT_MASK                      equ 0038h
SSP1SSPPS_SSP1SSPPS_POSN                 equ 0000h
SSP1SSPPS_SSP1SSPPS_POSITION             equ 0000h
SSP1SSPPS_SSP1SSPPS_SIZE                 equ 0006h
SSP1SSPPS_SSP1SSPPS_LENGTH               equ 0006h
SSP1SSPPS_SSP1SSPPS_MASK                 equ 003Fh
SSP1SSPPS_SSP1SSPPS0_POSN                equ 0000h
SSP1SSPPS_SSP1SSPPS0_POSITION            equ 0000h
SSP1SSPPS_SSP1SSPPS0_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS0_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS0_MASK                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSN                equ 0001h
SSP1SSPPS_SSP1SSPPS1_POSITION            equ 0001h
SSP1SSPPS_SSP1SSPPS1_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS1_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS1_MASK                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSN                equ 0002h
SSP1SSPPS_SSP1SSPPS2_POSITION            equ 0002h
SSP1SSPPS_SSP1SSPPS2_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS2_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS2_MASK                equ 0004h
SSP1SSPPS_SSP1SSPPS3_POSN                equ 0003h
SSP1SSPPS_SSP1SSPPS3_POSITION            equ 0003h
SSP1SSPPS_SSP1SSPPS3_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS3_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS3_MASK                equ 0008h
SSP1SSPPS_SSP1SSPPS4_POSN                equ 0004h
SSP1SSPPS_SSP1SSPPS4_POSITION            equ 0004h
SSP1SSPPS_SSP1SSPPS4_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS4_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS4_MASK                equ 0010h
SSP1SSPPS_SSP1SSPPS5_POSN                equ 0005h
SSP1SSPPS_SSP1SSPPS5_POSITION            equ 0005h
SSP1SSPPS_SSP1SSPPS5_SIZE                equ 0001h
SSP1SSPPS_SSP1SSPPS5_LENGTH              equ 0001h
SSP1SSPPS_SSP1SSPPS5_MASK                equ 0020h

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
SSP2CLKPPS                               equ 0E1Ch
// bitfield definitions
SSP2CLKPPS_PIN_POSN                      equ 0000h
SSP2CLKPPS_PIN_POSITION                  equ 0000h
SSP2CLKPPS_PIN_SIZE                      equ 0003h
SSP2CLKPPS_PIN_LENGTH                    equ 0003h
SSP2CLKPPS_PIN_MASK                      equ 0007h
SSP2CLKPPS_PORT_POSN                     equ 0003h
SSP2CLKPPS_PORT_POSITION                 equ 0003h
SSP2CLKPPS_PORT_SIZE                     equ 0002h
SSP2CLKPPS_PORT_LENGTH                   equ 0002h
SSP2CLKPPS_PORT_MASK                     equ 0018h
SSP2CLKPPS_SSP2CLKPPS_POSN               equ 0000h
SSP2CLKPPS_SSP2CLKPPS_POSITION           equ 0000h
SSP2CLKPPS_SSP2CLKPPS_SIZE               equ 0006h
SSP2CLKPPS_SSP2CLKPPS_LENGTH             equ 0006h
SSP2CLKPPS_SSP2CLKPPS_MASK               equ 003Fh
SSP2CLKPPS_SSP2CLKPPS0_POSN              equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_POSITION          equ 0000h
SSP2CLKPPS_SSP2CLKPPS0_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS0_MASK              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSN              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_POSITION          equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS1_MASK              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSN              equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_POSITION          equ 0002h
SSP2CLKPPS_SSP2CLKPPS2_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS2_MASK              equ 0004h
SSP2CLKPPS_SSP2CLKPPS3_POSN              equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_POSITION          equ 0003h
SSP2CLKPPS_SSP2CLKPPS3_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS3_MASK              equ 0008h
SSP2CLKPPS_SSP2CLKPPS4_POSN              equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_POSITION          equ 0004h
SSP2CLKPPS_SSP2CLKPPS4_SIZE              equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_LENGTH            equ 0001h
SSP2CLKPPS_SSP2CLKPPS4_MASK              equ 0010h

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
SSP2DATPPS                               equ 0E1Dh
// bitfield definitions
SSP2DATPPS_PIN_POSN                      equ 0000h
SSP2DATPPS_PIN_POSITION                  equ 0000h
SSP2DATPPS_PIN_SIZE                      equ 0003h
SSP2DATPPS_PIN_LENGTH                    equ 0003h
SSP2DATPPS_PIN_MASK                      equ 0007h
SSP2DATPPS_PORT_POSN                     equ 0003h
SSP2DATPPS_PORT_POSITION                 equ 0003h
SSP2DATPPS_PORT_SIZE                     equ 0002h
SSP2DATPPS_PORT_LENGTH                   equ 0002h
SSP2DATPPS_PORT_MASK                     equ 0018h
SSP2DATPPS_SSP2DATPPS_POSN               equ 0000h
SSP2DATPPS_SSP2DATPPS_POSITION           equ 0000h
SSP2DATPPS_SSP2DATPPS_SIZE               equ 0006h
SSP2DATPPS_SSP2DATPPS_LENGTH             equ 0006h
SSP2DATPPS_SSP2DATPPS_MASK               equ 003Fh
SSP2DATPPS_SSP2DATPPS0_POSN              equ 0000h
SSP2DATPPS_SSP2DATPPS0_POSITION          equ 0000h
SSP2DATPPS_SSP2DATPPS0_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS0_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS0_MASK              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSN              equ 0001h
SSP2DATPPS_SSP2DATPPS1_POSITION          equ 0001h
SSP2DATPPS_SSP2DATPPS1_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS1_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS1_MASK              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSN              equ 0002h
SSP2DATPPS_SSP2DATPPS2_POSITION          equ 0002h
SSP2DATPPS_SSP2DATPPS2_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS2_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS2_MASK              equ 0004h
SSP2DATPPS_SSP2DATPPS3_POSN              equ 0003h
SSP2DATPPS_SSP2DATPPS3_POSITION          equ 0003h
SSP2DATPPS_SSP2DATPPS3_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS3_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS3_MASK              equ 0008h
SSP2DATPPS_SSP2DATPPS4_POSN              equ 0004h
SSP2DATPPS_SSP2DATPPS4_POSITION          equ 0004h
SSP2DATPPS_SSP2DATPPS4_SIZE              equ 0001h
SSP2DATPPS_SSP2DATPPS4_LENGTH            equ 0001h
SSP2DATPPS_SSP2DATPPS4_MASK              equ 0010h

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
SSP2SSPPS                                equ 0E1Eh
// bitfield definitions
SSP2SSPPS_PIN_POSN                       equ 0000h
SSP2SSPPS_PIN_POSITION                   equ 0000h
SSP2SSPPS_PIN_SIZE                       equ 0003h
SSP2SSPPS_PIN_LENGTH                     equ 0003h
SSP2SSPPS_PIN_MASK                       equ 0007h
SSP2SSPPS_PORT_POSN                      equ 0003h
SSP2SSPPS_PORT_POSITION                  equ 0003h
SSP2SSPPS_PORT_SIZE                      equ 0002h
SSP2SSPPS_PORT_LENGTH                    equ 0002h
SSP2SSPPS_PORT_MASK                      equ 0018h
SSP2SSPPS_SSP2SSPPS_POSN                 equ 0000h
SSP2SSPPS_SSP2SSPPS_POSITION             equ 0000h
SSP2SSPPS_SSP2SSPPS_SIZE                 equ 0006h
SSP2SSPPS_SSP2SSPPS_LENGTH               equ 0006h
SSP2SSPPS_SSP2SSPPS_MASK                 equ 003Fh
SSP2SSPPS_SSP2SSPPS0_POSN                equ 0000h
SSP2SSPPS_SSP2SSPPS0_POSITION            equ 0000h
SSP2SSPPS_SSP2SSPPS0_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS0_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS0_MASK                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSN                equ 0001h
SSP2SSPPS_SSP2SSPPS1_POSITION            equ 0001h
SSP2SSPPS_SSP2SSPPS1_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS1_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS1_MASK                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSN                equ 0002h
SSP2SSPPS_SSP2SSPPS2_POSITION            equ 0002h
SSP2SSPPS_SSP2SSPPS2_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS2_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS2_MASK                equ 0004h
SSP2SSPPS_SSP2SSPPS3_POSN                equ 0003h
SSP2SSPPS_SSP2SSPPS3_POSITION            equ 0003h
SSP2SSPPS_SSP2SSPPS3_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS3_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS3_MASK                equ 0008h
SSP2SSPPS_SSP2SSPPS4_POSN                equ 0004h
SSP2SSPPS_SSP2SSPPS4_POSITION            equ 0004h
SSP2SSPPS_SSP2SSPPS4_SIZE                equ 0001h
SSP2SSPPS_SSP2SSPPS4_LENGTH              equ 0001h
SSP2SSPPS_SSP2SSPPS4_MASK                equ 0010h

// Register: IPR0
#define IPR0 IPR0
IPR0                                     equ 0E1Fh
// bitfield definitions
IPR0_INT0IP_POSN                         equ 0000h
IPR0_INT0IP_POSITION                     equ 0000h
IPR0_INT0IP_SIZE                         equ 0001h
IPR0_INT0IP_LENGTH                       equ 0001h
IPR0_INT0IP_MASK                         equ 0001h
IPR0_INT1IP_POSN                         equ 0001h
IPR0_INT1IP_POSITION                     equ 0001h
IPR0_INT1IP_SIZE                         equ 0001h
IPR0_INT1IP_LENGTH                       equ 0001h
IPR0_INT1IP_MASK                         equ 0002h
IPR0_INT2IP_POSN                         equ 0002h
IPR0_INT2IP_POSITION                     equ 0002h
IPR0_INT2IP_SIZE                         equ 0001h
IPR0_INT2IP_LENGTH                       equ 0001h
IPR0_INT2IP_MASK                         equ 0004h
IPR0_INT3IP_POSN                         equ 0003h
IPR0_INT3IP_POSITION                     equ 0003h
IPR0_INT3IP_SIZE                         equ 0001h
IPR0_INT3IP_LENGTH                       equ 0001h
IPR0_INT3IP_MASK                         equ 0008h
IPR0_IOCIP_POSN                          equ 0004h
IPR0_IOCIP_POSITION                      equ 0004h
IPR0_IOCIP_SIZE                          equ 0001h
IPR0_IOCIP_LENGTH                        equ 0001h
IPR0_IOCIP_MASK                          equ 0010h
IPR0_TMR0IP_POSN                         equ 0005h
IPR0_TMR0IP_POSITION                     equ 0005h
IPR0_TMR0IP_SIZE                         equ 0001h
IPR0_TMR0IP_LENGTH                       equ 0001h
IPR0_TMR0IP_MASK                         equ 0020h

// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 0E20h
// bitfield definitions
IPR1_ADIP_POSN                           equ 0000h
IPR1_ADIP_POSITION                       equ 0000h
IPR1_ADIP_SIZE                           equ 0001h
IPR1_ADIP_LENGTH                         equ 0001h
IPR1_ADIP_MASK                           equ 0001h
IPR1_ADTIP_POSN                          equ 0001h
IPR1_ADTIP_POSITION                      equ 0001h
IPR1_ADTIP_SIZE                          equ 0001h
IPR1_ADTIP_LENGTH                        equ 0001h
IPR1_ADTIP_MASK                          equ 0002h
IPR1_CSWIP_POSN                          equ 0006h
IPR1_CSWIP_POSITION                      equ 0006h
IPR1_CSWIP_SIZE                          equ 0001h
IPR1_CSWIP_LENGTH                        equ 0001h
IPR1_CSWIP_MASK                          equ 0040h
IPR1_OSCFIP_POSN                         equ 0007h
IPR1_OSCFIP_POSITION                     equ 0007h
IPR1_OSCFIP_SIZE                         equ 0001h
IPR1_OSCFIP_LENGTH                       equ 0001h
IPR1_OSCFIP_MASK                         equ 0080h
IPR1_PSPIP_POSN                          equ 0007h
IPR1_PSPIP_POSITION                      equ 0007h
IPR1_PSPIP_SIZE                          equ 0001h
IPR1_PSPIP_LENGTH                        equ 0001h
IPR1_PSPIP_MASK                          equ 0080h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 0E21h
// bitfield definitions
IPR2_C1IP_POSN                           equ 0000h
IPR2_C1IP_POSITION                       equ 0000h
IPR2_C1IP_SIZE                           equ 0001h
IPR2_C1IP_LENGTH                         equ 0001h
IPR2_C1IP_MASK                           equ 0001h
IPR2_C2IP_POSN                           equ 0001h
IPR2_C2IP_POSITION                       equ 0001h
IPR2_C2IP_SIZE                           equ 0001h
IPR2_C2IP_LENGTH                         equ 0001h
IPR2_C2IP_MASK                           equ 0002h
IPR2_C3IP_POSN                           equ 0002h
IPR2_C3IP_POSITION                       equ 0002h
IPR2_C3IP_SIZE                           equ 0001h
IPR2_C3IP_LENGTH                         equ 0001h
IPR2_C3IP_MASK                           equ 0004h
IPR2_ZCDIP_POSN                          equ 0006h
IPR2_ZCDIP_POSITION                      equ 0006h
IPR2_ZCDIP_SIZE                          equ 0001h
IPR2_ZCDIP_LENGTH                        equ 0001h
IPR2_ZCDIP_MASK                          equ 0040h
IPR2_HLVDIP_POSN                         equ 0007h
IPR2_HLVDIP_POSITION                     equ 0007h
IPR2_HLVDIP_SIZE                         equ 0001h
IPR2_HLVDIP_LENGTH                       equ 0001h
IPR2_HLVDIP_MASK                         equ 0080h
IPR2_CMIP_POSN                           equ 0006h
IPR2_CMIP_POSITION                       equ 0006h
IPR2_CMIP_SIZE                           equ 0001h
IPR2_CMIP_LENGTH                         equ 0001h
IPR2_CMIP_MASK                           equ 0040h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 0E22h
// bitfield definitions
IPR3_SSP1IP_POSN                         equ 0000h
IPR3_SSP1IP_POSITION                     equ 0000h
IPR3_SSP1IP_SIZE                         equ 0001h
IPR3_SSP1IP_LENGTH                       equ 0001h
IPR3_SSP1IP_MASK                         equ 0001h
IPR3_BCL1IP_POSN                         equ 0001h
IPR3_BCL1IP_POSITION                     equ 0001h
IPR3_BCL1IP_SIZE                         equ 0001h
IPR3_BCL1IP_LENGTH                       equ 0001h
IPR3_BCL1IP_MASK                         equ 0002h
IPR3_SSP2IP_POSN                         equ 0002h
IPR3_SSP2IP_POSITION                     equ 0002h
IPR3_SSP2IP_SIZE                         equ 0001h
IPR3_SSP2IP_LENGTH                       equ 0001h
IPR3_SSP2IP_MASK                         equ 0004h
IPR3_BCL2IP_POSN                         equ 0003h
IPR3_BCL2IP_POSITION                     equ 0003h
IPR3_BCL2IP_SIZE                         equ 0001h
IPR3_BCL2IP_LENGTH                       equ 0001h
IPR3_BCL2IP_MASK                         equ 0008h
IPR3_TX1IP_POSN                          equ 0004h
IPR3_TX1IP_POSITION                      equ 0004h
IPR3_TX1IP_SIZE                          equ 0001h
IPR3_TX1IP_LENGTH                        equ 0001h
IPR3_TX1IP_MASK                          equ 0010h
IPR3_RC1IP_POSN                          equ 0005h
IPR3_RC1IP_POSITION                      equ 0005h
IPR3_RC1IP_SIZE                          equ 0001h
IPR3_RC1IP_LENGTH                        equ 0001h
IPR3_RC1IP_MASK                          equ 0020h
IPR3_TX2IP_POSN                          equ 0006h
IPR3_TX2IP_POSITION                      equ 0006h
IPR3_TX2IP_SIZE                          equ 0001h
IPR3_TX2IP_LENGTH                        equ 0001h
IPR3_TX2IP_MASK                          equ 0040h
IPR3_RC2IP_POSN                          equ 0007h
IPR3_RC2IP_POSITION                      equ 0007h
IPR3_RC2IP_SIZE                          equ 0001h
IPR3_RC2IP_LENGTH                        equ 0001h
IPR3_RC2IP_MASK                          equ 0080h
IPR3_RXBNIP_POSN                         equ 0001h
IPR3_RXBNIP_POSITION                     equ 0001h
IPR3_RXBNIP_SIZE                         equ 0001h
IPR3_RXBNIP_LENGTH                       equ 0001h
IPR3_RXBNIP_MASK                         equ 0002h
IPR3_TXBNIP_POSN                         equ 0004h
IPR3_TXBNIP_POSITION                     equ 0004h
IPR3_TXBNIP_SIZE                         equ 0001h
IPR3_TXBNIP_LENGTH                       equ 0001h
IPR3_TXBNIP_MASK                         equ 0010h

