GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
// Register: RE3PPS
#define RE3PPS RE3PPS
RE3PPS                                   equ 0E75h
// bitfield definitions
RE3PPS_RE3PPS0_POSN                      equ 0000h
RE3PPS_RE3PPS0_POSITION                  equ 0000h
RE3PPS_RE3PPS0_SIZE                      equ 0001h
RE3PPS_RE3PPS0_LENGTH                    equ 0001h
RE3PPS_RE3PPS0_MASK                      equ 0001h
RE3PPS_RE3PPS1_POSN                      equ 0001h
RE3PPS_RE3PPS1_POSITION                  equ 0001h
RE3PPS_RE3PPS1_SIZE                      equ 0001h
RE3PPS_RE3PPS1_LENGTH                    equ 0001h
RE3PPS_RE3PPS1_MASK                      equ 0002h
RE3PPS_RE3PPS2_POSN                      equ 0002h
RE3PPS_RE3PPS2_POSITION                  equ 0002h
RE3PPS_RE3PPS2_SIZE                      equ 0001h
RE3PPS_RE3PPS2_LENGTH                    equ 0001h
RE3PPS_RE3PPS2_MASK                      equ 0004h
RE3PPS_RE3PPS3_POSN                      equ 0003h
RE3PPS_RE3PPS3_POSITION                  equ 0003h
RE3PPS_RE3PPS3_SIZE                      equ 0001h
RE3PPS_RE3PPS3_LENGTH                    equ 0001h
RE3PPS_RE3PPS3_MASK                      equ 0008h
RE3PPS_RE3PPS4_POSN                      equ 0004h
RE3PPS_RE3PPS4_POSITION                  equ 0004h
RE3PPS_RE3PPS4_SIZE                      equ 0001h
RE3PPS_RE3PPS4_LENGTH                    equ 0001h
RE3PPS_RE3PPS4_MASK                      equ 0010h
RE3PPS_RE3PPS5_POSN                      equ 0005h
RE3PPS_RE3PPS5_POSITION                  equ 0005h
RE3PPS_RE3PPS5_SIZE                      equ 0001h
RE3PPS_RE3PPS5_LENGTH                    equ 0001h
RE3PPS_RE3PPS5_MASK                      equ 0020h

// Register: RE4PPS
#define RE4PPS RE4PPS
RE4PPS                                   equ 0E76h
// bitfield definitions
RE4PPS_RE4PPS0_POSN                      equ 0000h
RE4PPS_RE4PPS0_POSITION                  equ 0000h
RE4PPS_RE4PPS0_SIZE                      equ 0001h
RE4PPS_RE4PPS0_LENGTH                    equ 0001h
RE4PPS_RE4PPS0_MASK                      equ 0001h
RE4PPS_RE4PPS1_POSN                      equ 0001h
RE4PPS_RE4PPS1_POSITION                  equ 0001h
RE4PPS_RE4PPS1_SIZE                      equ 0001h
RE4PPS_RE4PPS1_LENGTH                    equ 0001h
RE4PPS_RE4PPS1_MASK                      equ 0002h
RE4PPS_RE4PPS2_POSN                      equ 0002h
RE4PPS_RE4PPS2_POSITION                  equ 0002h
RE4PPS_RE4PPS2_SIZE                      equ 0001h
RE4PPS_RE4PPS2_LENGTH                    equ 0001h
RE4PPS_RE4PPS2_MASK                      equ 0004h
RE4PPS_RE4PPS3_POSN                      equ 0003h
RE4PPS_RE4PPS3_POSITION                  equ 0003h
RE4PPS_RE4PPS3_SIZE                      equ 0001h
RE4PPS_RE4PPS3_LENGTH                    equ 0001h
RE4PPS_RE4PPS3_MASK                      equ 0008h
RE4PPS_RE4PPS4_POSN                      equ 0004h
RE4PPS_RE4PPS4_POSITION                  equ 0004h
RE4PPS_RE4PPS4_SIZE                      equ 0001h
RE4PPS_RE4PPS4_LENGTH                    equ 0001h
RE4PPS_RE4PPS4_MASK                      equ 0010h
RE4PPS_RE4PPS5_POSN                      equ 0005h
RE4PPS_RE4PPS5_POSITION                  equ 0005h
RE4PPS_RE4PPS5_SIZE                      equ 0001h
RE4PPS_RE4PPS5_LENGTH                    equ 0001h
RE4PPS_RE4PPS5_MASK                      equ 0020h

// Register: RE5PPS
#define RE5PPS RE5PPS
RE5PPS                                   equ 0E77h
// bitfield definitions
RE5PPS_RE5PPS0_POSN                      equ 0000h
RE5PPS_RE5PPS0_POSITION                  equ 0000h
RE5PPS_RE5PPS0_SIZE                      equ 0001h
RE5PPS_RE5PPS0_LENGTH                    equ 0001h
RE5PPS_RE5PPS0_MASK                      equ 0001h
RE5PPS_RE5PPS1_POSN                      equ 0001h
RE5PPS_RE5PPS1_POSITION                  equ 0001h
RE5PPS_RE5PPS1_SIZE                      equ 0001h
RE5PPS_RE5PPS1_LENGTH                    equ 0001h
RE5PPS_RE5PPS1_MASK                      equ 0002h
RE5PPS_RE5PPS2_POSN                      equ 0002h
RE5PPS_RE5PPS2_POSITION                  equ 0002h
RE5PPS_RE5PPS2_SIZE                      equ 0001h
RE5PPS_RE5PPS2_LENGTH                    equ 0001h
RE5PPS_RE5PPS2_MASK                      equ 0004h
RE5PPS_RE5PPS3_POSN                      equ 0003h
RE5PPS_RE5PPS3_POSITION                  equ 0003h
RE5PPS_RE5PPS3_SIZE                      equ 0001h
RE5PPS_RE5PPS3_LENGTH                    equ 0001h
RE5PPS_RE5PPS3_MASK                      equ 0008h
RE5PPS_RE5PPS4_POSN                      equ 0004h
RE5PPS_RE5PPS4_POSITION                  equ 0004h
RE5PPS_RE5PPS4_SIZE                      equ 0001h
RE5PPS_RE5PPS4_LENGTH                    equ 0001h
RE5PPS_RE5PPS4_MASK                      equ 0010h
RE5PPS_RE5PPS5_POSN                      equ 0005h
RE5PPS_RE5PPS5_POSITION                  equ 0005h
RE5PPS_RE5PPS5_SIZE                      equ 0001h
RE5PPS_RE5PPS5_LENGTH                    equ 0001h
RE5PPS_RE5PPS5_MASK                      equ 0020h

// Register: RE6PPS
#define RE6PPS RE6PPS
RE6PPS                                   equ 0E78h
// bitfield definitions
RE6PPS_RE6PPS0_POSN                      equ 0000h
RE6PPS_RE6PPS0_POSITION                  equ 0000h
RE6PPS_RE6PPS0_SIZE                      equ 0001h
RE6PPS_RE6PPS0_LENGTH                    equ 0001h
RE6PPS_RE6PPS0_MASK                      equ 0001h
RE6PPS_RE6PPS1_POSN                      equ 0001h
RE6PPS_RE6PPS1_POSITION                  equ 0001h
RE6PPS_RE6PPS1_SIZE                      equ 0001h
RE6PPS_RE6PPS1_LENGTH                    equ 0001h
RE6PPS_RE6PPS1_MASK                      equ 0002h
RE6PPS_RE6PPS2_POSN                      equ 0002h
RE6PPS_RE6PPS2_POSITION                  equ 0002h
RE6PPS_RE6PPS2_SIZE                      equ 0001h
RE6PPS_RE6PPS2_LENGTH                    equ 0001h
RE6PPS_RE6PPS2_MASK                      equ 0004h
RE6PPS_RE6PPS3_POSN                      equ 0003h
RE6PPS_RE6PPS3_POSITION                  equ 0003h
RE6PPS_RE6PPS3_SIZE                      equ 0001h
RE6PPS_RE6PPS3_LENGTH                    equ 0001h
RE6PPS_RE6PPS3_MASK                      equ 0008h
RE6PPS_RE6PPS4_POSN                      equ 0004h
RE6PPS_RE6PPS4_POSITION                  equ 0004h
RE6PPS_RE6PPS4_SIZE                      equ 0001h
RE6PPS_RE6PPS4_LENGTH                    equ 0001h
RE6PPS_RE6PPS4_MASK                      equ 0010h
RE6PPS_RE6PPS5_POSN                      equ 0005h
RE6PPS_RE6PPS5_POSITION                  equ 0005h
RE6PPS_RE6PPS5_SIZE                      equ 0001h
RE6PPS_RE6PPS5_LENGTH                    equ 0001h
RE6PPS_RE6PPS5_MASK                      equ 0020h

// Register: RE7PPS
#define RE7PPS RE7PPS
RE7PPS                                   equ 0E79h
// bitfield definitions
RE7PPS_RE7PPS0_POSN                      equ 0000h
RE7PPS_RE7PPS0_POSITION                  equ 0000h
RE7PPS_RE7PPS0_SIZE                      equ 0001h
RE7PPS_RE7PPS0_LENGTH                    equ 0001h
RE7PPS_RE7PPS0_MASK                      equ 0001h
RE7PPS_RE7PPS1_POSN                      equ 0001h
RE7PPS_RE7PPS1_POSITION                  equ 0001h
RE7PPS_RE7PPS1_SIZE                      equ 0001h
RE7PPS_RE7PPS1_LENGTH                    equ 0001h
RE7PPS_RE7PPS1_MASK                      equ 0002h
RE7PPS_RE7PPS2_POSN                      equ 0002h
RE7PPS_RE7PPS2_POSITION                  equ 0002h
RE7PPS_RE7PPS2_SIZE                      equ 0001h
RE7PPS_RE7PPS2_LENGTH                    equ 0001h
RE7PPS_RE7PPS2_MASK                      equ 0004h
RE7PPS_RE7PPS3_POSN                      equ 0003h
RE7PPS_RE7PPS3_POSITION                  equ 0003h
RE7PPS_RE7PPS3_SIZE                      equ 0001h
RE7PPS_RE7PPS3_LENGTH                    equ 0001h
RE7PPS_RE7PPS3_MASK                      equ 0008h
RE7PPS_RE7PPS4_POSN                      equ 0004h
RE7PPS_RE7PPS4_POSITION                  equ 0004h
RE7PPS_RE7PPS4_SIZE                      equ 0001h
RE7PPS_RE7PPS4_LENGTH                    equ 0001h
RE7PPS_RE7PPS4_MASK                      equ 0010h
RE7PPS_RE7PPS5_POSN                      equ 0005h
RE7PPS_RE7PPS5_POSITION                  equ 0005h
RE7PPS_RE7PPS5_SIZE                      equ 0001h
RE7PPS_RE7PPS5_LENGTH                    equ 0001h
RE7PPS_RE7PPS5_MASK                      equ 0020h

// Register: RF0PPS
#define RF0PPS RF0PPS
RF0PPS                                   equ 0E7Ah
// bitfield definitions
RF0PPS_RF0PPS0_POSN                      equ 0000h
RF0PPS_RF0PPS0_POSITION                  equ 0000h
RF0PPS_RF0PPS0_SIZE                      equ 0001h
RF0PPS_RF0PPS0_LENGTH                    equ 0001h
RF0PPS_RF0PPS0_MASK                      equ 0001h
RF0PPS_RF0PPS1_POSN                      equ 0001h
RF0PPS_RF0PPS1_POSITION                  equ 0001h
RF0PPS_RF0PPS1_SIZE                      equ 0001h
RF0PPS_RF0PPS1_LENGTH                    equ 0001h
RF0PPS_RF0PPS1_MASK                      equ 0002h
RF0PPS_RF0PPS2_POSN                      equ 0002h
RF0PPS_RF0PPS2_POSITION                  equ 0002h
RF0PPS_RF0PPS2_SIZE                      equ 0001h
RF0PPS_RF0PPS2_LENGTH                    equ 0001h
RF0PPS_RF0PPS2_MASK                      equ 0004h
RF0PPS_RF0PPS3_POSN                      equ 0003h
RF0PPS_RF0PPS3_POSITION                  equ 0003h
RF0PPS_RF0PPS3_SIZE                      equ 0001h
RF0PPS_RF0PPS3_LENGTH                    equ 0001h
RF0PPS_RF0PPS3_MASK                      equ 0008h
RF0PPS_RF0PPS4_POSN                      equ 0004h
RF0PPS_RF0PPS4_POSITION                  equ 0004h
RF0PPS_RF0PPS4_SIZE                      equ 0001h
RF0PPS_RF0PPS4_LENGTH                    equ 0001h
RF0PPS_RF0PPS4_MASK                      equ 0010h
RF0PPS_RF0PPS5_POSN                      equ 0005h
RF0PPS_RF0PPS5_POSITION                  equ 0005h
RF0PPS_RF0PPS5_SIZE                      equ 0001h
RF0PPS_RF0PPS5_LENGTH                    equ 0001h
RF0PPS_RF0PPS5_MASK                      equ 0020h

// Register: RF1PPS
#define RF1PPS RF1PPS
RF1PPS                                   equ 0E7Bh
// bitfield definitions
RF1PPS_RF1PPS0_POSN                      equ 0000h
RF1PPS_RF1PPS0_POSITION                  equ 0000h
RF1PPS_RF1PPS0_SIZE                      equ 0001h
RF1PPS_RF1PPS0_LENGTH                    equ 0001h
RF1PPS_RF1PPS0_MASK                      equ 0001h
RF1PPS_RF1PPS1_POSN                      equ 0001h
RF1PPS_RF1PPS1_POSITION                  equ 0001h
RF1PPS_RF1PPS1_SIZE                      equ 0001h
RF1PPS_RF1PPS1_LENGTH                    equ 0001h
RF1PPS_RF1PPS1_MASK                      equ 0002h
RF1PPS_RF1PPS2_POSN                      equ 0002h
RF1PPS_RF1PPS2_POSITION                  equ 0002h
RF1PPS_RF1PPS2_SIZE                      equ 0001h
RF1PPS_RF1PPS2_LENGTH                    equ 0001h
RF1PPS_RF1PPS2_MASK                      equ 0004h
RF1PPS_RF1PPS3_POSN                      equ 0003h
RF1PPS_RF1PPS3_POSITION                  equ 0003h
RF1PPS_RF1PPS3_SIZE                      equ 0001h
RF1PPS_RF1PPS3_LENGTH                    equ 0001h
RF1PPS_RF1PPS3_MASK                      equ 0008h
RF1PPS_RF1PPS4_POSN                      equ 0004h
RF1PPS_RF1PPS4_POSITION                  equ 0004h
RF1PPS_RF1PPS4_SIZE                      equ 0001h
RF1PPS_RF1PPS4_LENGTH                    equ 0001h
RF1PPS_RF1PPS4_MASK                      equ 0010h
RF1PPS_RF1PPS5_POSN                      equ 0005h
RF1PPS_RF1PPS5_POSITION                  equ 0005h
RF1PPS_RF1PPS5_SIZE                      equ 0001h
RF1PPS_RF1PPS5_LENGTH                    equ 0001h
RF1PPS_RF1PPS5_MASK                      equ 0020h

// Register: RF2PPS
#define RF2PPS RF2PPS
RF2PPS                                   equ 0E7Ch
// bitfield definitions
RF2PPS_RF2PPS0_POSN                      equ 0000h
RF2PPS_RF2PPS0_POSITION                  equ 0000h
RF2PPS_RF2PPS0_SIZE                      equ 0001h
RF2PPS_RF2PPS0_LENGTH                    equ 0001h
RF2PPS_RF2PPS0_MASK                      equ 0001h
RF2PPS_RF2PPS1_POSN                      equ 0001h
RF2PPS_RF2PPS1_POSITION                  equ 0001h
RF2PPS_RF2PPS1_SIZE                      equ 0001h
RF2PPS_RF2PPS1_LENGTH                    equ 0001h
RF2PPS_RF2PPS1_MASK                      equ 0002h
RF2PPS_RF2PPS2_POSN                      equ 0002h
RF2PPS_RF2PPS2_POSITION                  equ 0002h
RF2PPS_RF2PPS2_SIZE                      equ 0001h
RF2PPS_RF2PPS2_LENGTH                    equ 0001h
RF2PPS_RF2PPS2_MASK                      equ 0004h
RF2PPS_RF2PPS3_POSN                      equ 0003h
RF2PPS_RF2PPS3_POSITION                  equ 0003h
RF2PPS_RF2PPS3_SIZE                      equ 0001h
RF2PPS_RF2PPS3_LENGTH                    equ 0001h
RF2PPS_RF2PPS3_MASK                      equ 0008h
RF2PPS_RF2PPS4_POSN                      equ 0004h
RF2PPS_RF2PPS4_POSITION                  equ 0004h
RF2PPS_RF2PPS4_SIZE                      equ 0001h
RF2PPS_RF2PPS4_LENGTH                    equ 0001h
RF2PPS_RF2PPS4_MASK                      equ 0010h
RF2PPS_RF2PPS5_POSN                      equ 0005h
RF2PPS_RF2PPS5_POSITION                  equ 0005h
RF2PPS_RF2PPS5_SIZE                      equ 0001h
RF2PPS_RF2PPS5_LENGTH                    equ 0001h
RF2PPS_RF2PPS5_MASK                      equ 0020h

