GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
// Register: RF3PPS
#define RF3PPS RF3PPS
RF3PPS                                   equ 0E7Dh
// bitfield definitions
RF3PPS_RF3PPS0_POSN                      equ 0000h
RF3PPS_RF3PPS0_POSITION                  equ 0000h
RF3PPS_RF3PPS0_SIZE                      equ 0001h
RF3PPS_RF3PPS0_LENGTH                    equ 0001h
RF3PPS_RF3PPS0_MASK                      equ 0001h
RF3PPS_RF3PPS1_POSN                      equ 0001h
RF3PPS_RF3PPS1_POSITION                  equ 0001h
RF3PPS_RF3PPS1_SIZE                      equ 0001h
RF3PPS_RF3PPS1_LENGTH                    equ 0001h
RF3PPS_RF3PPS1_MASK                      equ 0002h
RF3PPS_RF3PPS2_POSN                      equ 0002h
RF3PPS_RF3PPS2_POSITION                  equ 0002h
RF3PPS_RF3PPS2_SIZE                      equ 0001h
RF3PPS_RF3PPS2_LENGTH                    equ 0001h
RF3PPS_RF3PPS2_MASK                      equ 0004h
RF3PPS_RF3PPS3_POSN                      equ 0003h
RF3PPS_RF3PPS3_POSITION                  equ 0003h
RF3PPS_RF3PPS3_SIZE                      equ 0001h
RF3PPS_RF3PPS3_LENGTH                    equ 0001h
RF3PPS_RF3PPS3_MASK                      equ 0008h
RF3PPS_RF3PPS4_POSN                      equ 0004h
RF3PPS_RF3PPS4_POSITION                  equ 0004h
RF3PPS_RF3PPS4_SIZE                      equ 0001h
RF3PPS_RF3PPS4_LENGTH                    equ 0001h
RF3PPS_RF3PPS4_MASK                      equ 0010h
RF3PPS_RF3PPS5_POSN                      equ 0005h
RF3PPS_RF3PPS5_POSITION                  equ 0005h
RF3PPS_RF3PPS5_SIZE                      equ 0001h
RF3PPS_RF3PPS5_LENGTH                    equ 0001h
RF3PPS_RF3PPS5_MASK                      equ 0020h

// Register: RF4PPS
#define RF4PPS RF4PPS
RF4PPS                                   equ 0E7Eh
// bitfield definitions
RF4PPS_RF4PPS0_POSN                      equ 0000h
RF4PPS_RF4PPS0_POSITION                  equ 0000h
RF4PPS_RF4PPS0_SIZE                      equ 0001h
RF4PPS_RF4PPS0_LENGTH                    equ 0001h
RF4PPS_RF4PPS0_MASK                      equ 0001h
RF4PPS_RF4PPS1_POSN                      equ 0001h
RF4PPS_RF4PPS1_POSITION                  equ 0001h
RF4PPS_RF4PPS1_SIZE                      equ 0001h
RF4PPS_RF4PPS1_LENGTH                    equ 0001h
RF4PPS_RF4PPS1_MASK                      equ 0002h
RF4PPS_RF4PPS2_POSN                      equ 0002h
RF4PPS_RF4PPS2_POSITION                  equ 0002h
RF4PPS_RF4PPS2_SIZE                      equ 0001h
RF4PPS_RF4PPS2_LENGTH                    equ 0001h
RF4PPS_RF4PPS2_MASK                      equ 0004h
RF4PPS_RF4PPS3_POSN                      equ 0003h
RF4PPS_RF4PPS3_POSITION                  equ 0003h
RF4PPS_RF4PPS3_SIZE                      equ 0001h
RF4PPS_RF4PPS3_LENGTH                    equ 0001h
RF4PPS_RF4PPS3_MASK                      equ 0008h
RF4PPS_RF4PPS4_POSN                      equ 0004h
RF4PPS_RF4PPS4_POSITION                  equ 0004h
RF4PPS_RF4PPS4_SIZE                      equ 0001h
RF4PPS_RF4PPS4_LENGTH                    equ 0001h
RF4PPS_RF4PPS4_MASK                      equ 0010h
RF4PPS_RF4PPS5_POSN                      equ 0005h
RF4PPS_RF4PPS5_POSITION                  equ 0005h
RF4PPS_RF4PPS5_SIZE                      equ 0001h
RF4PPS_RF4PPS5_LENGTH                    equ 0001h
RF4PPS_RF4PPS5_MASK                      equ 0020h

// Register: RF5PPS
#define RF5PPS RF5PPS
RF5PPS                                   equ 0E7Fh
// bitfield definitions
RF5PPS_RF5PPS0_POSN                      equ 0000h
RF5PPS_RF5PPS0_POSITION                  equ 0000h
RF5PPS_RF5PPS0_SIZE                      equ 0001h
RF5PPS_RF5PPS0_LENGTH                    equ 0001h
RF5PPS_RF5PPS0_MASK                      equ 0001h
RF5PPS_RF5PPS1_POSN                      equ 0001h
RF5PPS_RF5PPS1_POSITION                  equ 0001h
RF5PPS_RF5PPS1_SIZE                      equ 0001h
RF5PPS_RF5PPS1_LENGTH                    equ 0001h
RF5PPS_RF5PPS1_MASK                      equ 0002h
RF5PPS_RF5PPS2_POSN                      equ 0002h
RF5PPS_RF5PPS2_POSITION                  equ 0002h
RF5PPS_RF5PPS2_SIZE                      equ 0001h
RF5PPS_RF5PPS2_LENGTH                    equ 0001h
RF5PPS_RF5PPS2_MASK                      equ 0004h
RF5PPS_RF5PPS3_POSN                      equ 0003h
RF5PPS_RF5PPS3_POSITION                  equ 0003h
RF5PPS_RF5PPS3_SIZE                      equ 0001h
RF5PPS_RF5PPS3_LENGTH                    equ 0001h
RF5PPS_RF5PPS3_MASK                      equ 0008h
RF5PPS_RF5PPS4_POSN                      equ 0004h
RF5PPS_RF5PPS4_POSITION                  equ 0004h
RF5PPS_RF5PPS4_SIZE                      equ 0001h
RF5PPS_RF5PPS4_LENGTH                    equ 0001h
RF5PPS_RF5PPS4_MASK                      equ 0010h
RF5PPS_RF5PPS5_POSN                      equ 0005h
RF5PPS_RF5PPS5_POSITION                  equ 0005h
RF5PPS_RF5PPS5_SIZE                      equ 0001h
RF5PPS_RF5PPS5_LENGTH                    equ 0001h
RF5PPS_RF5PPS5_MASK                      equ 0020h

// Register: RF6PPS
#define RF6PPS RF6PPS
RF6PPS                                   equ 0E80h
// bitfield definitions
RF6PPS_RF6PPS0_POSN                      equ 0000h
RF6PPS_RF6PPS0_POSITION                  equ 0000h
RF6PPS_RF6PPS0_SIZE                      equ 0001h
RF6PPS_RF6PPS0_LENGTH                    equ 0001h
RF6PPS_RF6PPS0_MASK                      equ 0001h
RF6PPS_RF6PPS1_POSN                      equ 0001h
RF6PPS_RF6PPS1_POSITION                  equ 0001h
RF6PPS_RF6PPS1_SIZE                      equ 0001h
RF6PPS_RF6PPS1_LENGTH                    equ 0001h
RF6PPS_RF6PPS1_MASK                      equ 0002h
RF6PPS_RF6PPS2_POSN                      equ 0002h
RF6PPS_RF6PPS2_POSITION                  equ 0002h
RF6PPS_RF6PPS2_SIZE                      equ 0001h
RF6PPS_RF6PPS2_LENGTH                    equ 0001h
RF6PPS_RF6PPS2_MASK                      equ 0004h
RF6PPS_RF6PPS3_POSN                      equ 0003h
RF6PPS_RF6PPS3_POSITION                  equ 0003h
RF6PPS_RF6PPS3_SIZE                      equ 0001h
RF6PPS_RF6PPS3_LENGTH                    equ 0001h
RF6PPS_RF6PPS3_MASK                      equ 0008h
RF6PPS_RF6PPS4_POSN                      equ 0004h
RF6PPS_RF6PPS4_POSITION                  equ 0004h
RF6PPS_RF6PPS4_SIZE                      equ 0001h
RF6PPS_RF6PPS4_LENGTH                    equ 0001h
RF6PPS_RF6PPS4_MASK                      equ 0010h
RF6PPS_RF6PPS5_POSN                      equ 0005h
RF6PPS_RF6PPS5_POSITION                  equ 0005h
RF6PPS_RF6PPS5_SIZE                      equ 0001h
RF6PPS_RF6PPS5_LENGTH                    equ 0001h
RF6PPS_RF6PPS5_MASK                      equ 0020h

// Register: RF7PPS
#define RF7PPS RF7PPS
RF7PPS                                   equ 0E81h
// bitfield definitions
RF7PPS_RF7PPS0_POSN                      equ 0000h
RF7PPS_RF7PPS0_POSITION                  equ 0000h
RF7PPS_RF7PPS0_SIZE                      equ 0001h
RF7PPS_RF7PPS0_LENGTH                    equ 0001h
RF7PPS_RF7PPS0_MASK                      equ 0001h
RF7PPS_RF7PPS1_POSN                      equ 0001h
RF7PPS_RF7PPS1_POSITION                  equ 0001h
RF7PPS_RF7PPS1_SIZE                      equ 0001h
RF7PPS_RF7PPS1_LENGTH                    equ 0001h
RF7PPS_RF7PPS1_MASK                      equ 0002h
RF7PPS_RF7PPS2_POSN                      equ 0002h
RF7PPS_RF7PPS2_POSITION                  equ 0002h
RF7PPS_RF7PPS2_SIZE                      equ 0001h
RF7PPS_RF7PPS2_LENGTH                    equ 0001h
RF7PPS_RF7PPS2_MASK                      equ 0004h
RF7PPS_RF7PPS3_POSN                      equ 0003h
RF7PPS_RF7PPS3_POSITION                  equ 0003h
RF7PPS_RF7PPS3_SIZE                      equ 0001h
RF7PPS_RF7PPS3_LENGTH                    equ 0001h
RF7PPS_RF7PPS3_MASK                      equ 0008h
RF7PPS_RF7PPS4_POSN                      equ 0004h
RF7PPS_RF7PPS4_POSITION                  equ 0004h
RF7PPS_RF7PPS4_SIZE                      equ 0001h
RF7PPS_RF7PPS4_LENGTH                    equ 0001h
RF7PPS_RF7PPS4_MASK                      equ 0010h
RF7PPS_RF7PPS5_POSN                      equ 0005h
RF7PPS_RF7PPS5_POSITION                  equ 0005h
RF7PPS_RF7PPS5_SIZE                      equ 0001h
RF7PPS_RF7PPS5_LENGTH                    equ 0001h
RF7PPS_RF7PPS5_MASK                      equ 0020h

// Register: RG0PPS
#define RG0PPS RG0PPS
RG0PPS                                   equ 0E82h
// bitfield definitions
RG0PPS_RG0PPS0_POSN                      equ 0000h
RG0PPS_RG0PPS0_POSITION                  equ 0000h
RG0PPS_RG0PPS0_SIZE                      equ 0001h
RG0PPS_RG0PPS0_LENGTH                    equ 0001h
RG0PPS_RG0PPS0_MASK                      equ 0001h
RG0PPS_RG0PPS1_POSN                      equ 0001h
RG0PPS_RG0PPS1_POSITION                  equ 0001h
RG0PPS_RG0PPS1_SIZE                      equ 0001h
RG0PPS_RG0PPS1_LENGTH                    equ 0001h
RG0PPS_RG0PPS1_MASK                      equ 0002h
RG0PPS_RG0PPS2_POSN                      equ 0002h
RG0PPS_RG0PPS2_POSITION                  equ 0002h
RG0PPS_RG0PPS2_SIZE                      equ 0001h
RG0PPS_RG0PPS2_LENGTH                    equ 0001h
RG0PPS_RG0PPS2_MASK                      equ 0004h
RG0PPS_RG0PPS3_POSN                      equ 0003h
RG0PPS_RG0PPS3_POSITION                  equ 0003h
RG0PPS_RG0PPS3_SIZE                      equ 0001h
RG0PPS_RG0PPS3_LENGTH                    equ 0001h
RG0PPS_RG0PPS3_MASK                      equ 0008h
RG0PPS_RG0PPS4_POSN                      equ 0004h
RG0PPS_RG0PPS4_POSITION                  equ 0004h
RG0PPS_RG0PPS4_SIZE                      equ 0001h
RG0PPS_RG0PPS4_LENGTH                    equ 0001h
RG0PPS_RG0PPS4_MASK                      equ 0010h
RG0PPS_RG0PPS5_POSN                      equ 0005h
RG0PPS_RG0PPS5_POSITION                  equ 0005h
RG0PPS_RG0PPS5_SIZE                      equ 0001h
RG0PPS_RG0PPS5_LENGTH                    equ 0001h
RG0PPS_RG0PPS5_MASK                      equ 0020h

// Register: RG1PPS
#define RG1PPS RG1PPS
RG1PPS                                   equ 0E83h
// bitfield definitions
RG1PPS_RG1PPS0_POSN                      equ 0000h
RG1PPS_RG1PPS0_POSITION                  equ 0000h
RG1PPS_RG1PPS0_SIZE                      equ 0001h
RG1PPS_RG1PPS0_LENGTH                    equ 0001h
RG1PPS_RG1PPS0_MASK                      equ 0001h
RG1PPS_RG1PPS1_POSN                      equ 0001h
RG1PPS_RG1PPS1_POSITION                  equ 0001h
RG1PPS_RG1PPS1_SIZE                      equ 0001h
RG1PPS_RG1PPS1_LENGTH                    equ 0001h
RG1PPS_RG1PPS1_MASK                      equ 0002h
RG1PPS_RG1PPS2_POSN                      equ 0002h
RG1PPS_RG1PPS2_POSITION                  equ 0002h
RG1PPS_RG1PPS2_SIZE                      equ 0001h
RG1PPS_RG1PPS2_LENGTH                    equ 0001h
RG1PPS_RG1PPS2_MASK                      equ 0004h
RG1PPS_RG1PPS3_POSN                      equ 0003h
RG1PPS_RG1PPS3_POSITION                  equ 0003h
RG1PPS_RG1PPS3_SIZE                      equ 0001h
RG1PPS_RG1PPS3_LENGTH                    equ 0001h
RG1PPS_RG1PPS3_MASK                      equ 0008h
RG1PPS_RG1PPS4_POSN                      equ 0004h
RG1PPS_RG1PPS4_POSITION                  equ 0004h
RG1PPS_RG1PPS4_SIZE                      equ 0001h
RG1PPS_RG1PPS4_LENGTH                    equ 0001h
RG1PPS_RG1PPS4_MASK                      equ 0010h
RG1PPS_RG1PPS5_POSN                      equ 0005h
RG1PPS_RG1PPS5_POSITION                  equ 0005h
RG1PPS_RG1PPS5_SIZE                      equ 0001h
RG1PPS_RG1PPS5_LENGTH                    equ 0001h
RG1PPS_RG1PPS5_MASK                      equ 0020h

// Register: RG2PPS
#define RG2PPS RG2PPS
RG2PPS                                   equ 0E84h
// bitfield definitions
RG2PPS_RG2PPS0_POSN                      equ 0000h
RG2PPS_RG2PPS0_POSITION                  equ 0000h
RG2PPS_RG2PPS0_SIZE                      equ 0001h
RG2PPS_RG2PPS0_LENGTH                    equ 0001h
RG2PPS_RG2PPS0_MASK                      equ 0001h
RG2PPS_RG2PPS1_POSN                      equ 0001h
RG2PPS_RG2PPS1_POSITION                  equ 0001h
RG2PPS_RG2PPS1_SIZE                      equ 0001h
RG2PPS_RG2PPS1_LENGTH                    equ 0001h
RG2PPS_RG2PPS1_MASK                      equ 0002h
RG2PPS_RG2PPS2_POSN                      equ 0002h
RG2PPS_RG2PPS2_POSITION                  equ 0002h
RG2PPS_RG2PPS2_SIZE                      equ 0001h
RG2PPS_RG2PPS2_LENGTH                    equ 0001h
RG2PPS_RG2PPS2_MASK                      equ 0004h
RG2PPS_RG2PPS3_POSN                      equ 0003h
RG2PPS_RG2PPS3_POSITION                  equ 0003h
RG2PPS_RG2PPS3_SIZE                      equ 0001h
RG2PPS_RG2PPS3_LENGTH                    equ 0001h
RG2PPS_RG2PPS3_MASK                      equ 0008h
RG2PPS_RG2PPS4_POSN                      equ 0004h
RG2PPS_RG2PPS4_POSITION                  equ 0004h
RG2PPS_RG2PPS4_SIZE                      equ 0001h
RG2PPS_RG2PPS4_LENGTH                    equ 0001h
RG2PPS_RG2PPS4_MASK                      equ 0010h
RG2PPS_RG2PPS5_POSN                      equ 0005h
RG2PPS_RG2PPS5_POSITION                  equ 0005h
RG2PPS_RG2PPS5_SIZE                      equ 0001h
RG2PPS_RG2PPS5_LENGTH                    equ 0001h
RG2PPS_RG2PPS5_MASK                      equ 0020h

