GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
// Register: ODCONF
#define ODCONF ODCONF
ODCONF                                   equ 0EB2h
// bitfield definitions
ODCONF_ODCF0_POSN                        equ 0000h
ODCONF_ODCF0_POSITION                    equ 0000h
ODCONF_ODCF0_SIZE                        equ 0001h
ODCONF_ODCF0_LENGTH                      equ 0001h
ODCONF_ODCF0_MASK                        equ 0001h
ODCONF_ODCF1_POSN                        equ 0001h
ODCONF_ODCF1_POSITION                    equ 0001h
ODCONF_ODCF1_SIZE                        equ 0001h
ODCONF_ODCF1_LENGTH                      equ 0001h
ODCONF_ODCF1_MASK                        equ 0002h
ODCONF_ODCF2_POSN                        equ 0002h
ODCONF_ODCF2_POSITION                    equ 0002h
ODCONF_ODCF2_SIZE                        equ 0001h
ODCONF_ODCF2_LENGTH                      equ 0001h
ODCONF_ODCF2_MASK                        equ 0004h
ODCONF_ODCF3_POSN                        equ 0003h
ODCONF_ODCF3_POSITION                    equ 0003h
ODCONF_ODCF3_SIZE                        equ 0001h
ODCONF_ODCF3_LENGTH                      equ 0001h
ODCONF_ODCF3_MASK                        equ 0008h
ODCONF_ODCF4_POSN                        equ 0004h
ODCONF_ODCF4_POSITION                    equ 0004h
ODCONF_ODCF4_SIZE                        equ 0001h
ODCONF_ODCF4_LENGTH                      equ 0001h
ODCONF_ODCF4_MASK                        equ 0010h
ODCONF_ODCF5_POSN                        equ 0005h
ODCONF_ODCF5_POSITION                    equ 0005h
ODCONF_ODCF5_SIZE                        equ 0001h
ODCONF_ODCF5_LENGTH                      equ 0001h
ODCONF_ODCF5_MASK                        equ 0020h
ODCONF_ODCF6_POSN                        equ 0006h
ODCONF_ODCF6_POSITION                    equ 0006h
ODCONF_ODCF6_SIZE                        equ 0001h
ODCONF_ODCF6_LENGTH                      equ 0001h
ODCONF_ODCF6_MASK                        equ 0040h
ODCONF_ODCF7_POSN                        equ 0007h
ODCONF_ODCF7_POSITION                    equ 0007h
ODCONF_ODCF7_SIZE                        equ 0001h
ODCONF_ODCF7_LENGTH                      equ 0001h
ODCONF_ODCF7_MASK                        equ 0080h

// Register: WPUF
#define WPUF WPUF
WPUF                                     equ 0EB3h
// bitfield definitions
WPUF_WPUF0_POSN                          equ 0000h
WPUF_WPUF0_POSITION                      equ 0000h
WPUF_WPUF0_SIZE                          equ 0001h
WPUF_WPUF0_LENGTH                        equ 0001h
WPUF_WPUF0_MASK                          equ 0001h
WPUF_WPUF1_POSN                          equ 0001h
WPUF_WPUF1_POSITION                      equ 0001h
WPUF_WPUF1_SIZE                          equ 0001h
WPUF_WPUF1_LENGTH                        equ 0001h
WPUF_WPUF1_MASK                          equ 0002h
WPUF_WPUF2_POSN                          equ 0002h
WPUF_WPUF2_POSITION                      equ 0002h
WPUF_WPUF2_SIZE                          equ 0001h
WPUF_WPUF2_LENGTH                        equ 0001h
WPUF_WPUF2_MASK                          equ 0004h
WPUF_WPUF3_POSN                          equ 0003h
WPUF_WPUF3_POSITION                      equ 0003h
WPUF_WPUF3_SIZE                          equ 0001h
WPUF_WPUF3_LENGTH                        equ 0001h
WPUF_WPUF3_MASK                          equ 0008h
WPUF_WPUF4_POSN                          equ 0004h
WPUF_WPUF4_POSITION                      equ 0004h
WPUF_WPUF4_SIZE                          equ 0001h
WPUF_WPUF4_LENGTH                        equ 0001h
WPUF_WPUF4_MASK                          equ 0010h
WPUF_WPUF5_POSN                          equ 0005h
WPUF_WPUF5_POSITION                      equ 0005h
WPUF_WPUF5_SIZE                          equ 0001h
WPUF_WPUF5_LENGTH                        equ 0001h
WPUF_WPUF5_MASK                          equ 0020h
WPUF_WPUF6_POSN                          equ 0006h
WPUF_WPUF6_POSITION                      equ 0006h
WPUF_WPUF6_SIZE                          equ 0001h
WPUF_WPUF6_LENGTH                        equ 0001h
WPUF_WPUF6_MASK                          equ 0040h
WPUF_WPUF7_POSN                          equ 0007h
WPUF_WPUF7_POSITION                      equ 0007h
WPUF_WPUF7_SIZE                          equ 0001h
WPUF_WPUF7_LENGTH                        equ 0001h
WPUF_WPUF7_MASK                          equ 0080h

// Register: ANSELF
#define ANSELF ANSELF
ANSELF                                   equ 0EB4h
// bitfield definitions
ANSELF_ANSELF0_POSN                      equ 0000h
ANSELF_ANSELF0_POSITION                  equ 0000h
ANSELF_ANSELF0_SIZE                      equ 0001h
ANSELF_ANSELF0_LENGTH                    equ 0001h
ANSELF_ANSELF0_MASK                      equ 0001h
ANSELF_ANSELF1_POSN                      equ 0001h
ANSELF_ANSELF1_POSITION                  equ 0001h
ANSELF_ANSELF1_SIZE                      equ 0001h
ANSELF_ANSELF1_LENGTH                    equ 0001h
ANSELF_ANSELF1_MASK                      equ 0002h
ANSELF_ANSELF2_POSN                      equ 0002h
ANSELF_ANSELF2_POSITION                  equ 0002h
ANSELF_ANSELF2_SIZE                      equ 0001h
ANSELF_ANSELF2_LENGTH                    equ 0001h
ANSELF_ANSELF2_MASK                      equ 0004h
ANSELF_ANSELF3_POSN                      equ 0003h
ANSELF_ANSELF3_POSITION                  equ 0003h
ANSELF_ANSELF3_SIZE                      equ 0001h
ANSELF_ANSELF3_LENGTH                    equ 0001h
ANSELF_ANSELF3_MASK                      equ 0008h
ANSELF_ANSELF4_POSN                      equ 0004h
ANSELF_ANSELF4_POSITION                  equ 0004h
ANSELF_ANSELF4_SIZE                      equ 0001h
ANSELF_ANSELF4_LENGTH                    equ 0001h
ANSELF_ANSELF4_MASK                      equ 0010h
ANSELF_ANSELF5_POSN                      equ 0005h
ANSELF_ANSELF5_POSITION                  equ 0005h
ANSELF_ANSELF5_SIZE                      equ 0001h
ANSELF_ANSELF5_LENGTH                    equ 0001h
ANSELF_ANSELF5_MASK                      equ 0020h
ANSELF_ANSELF6_POSN                      equ 0006h
ANSELF_ANSELF6_POSITION                  equ 0006h
ANSELF_ANSELF6_SIZE                      equ 0001h
ANSELF_ANSELF6_LENGTH                    equ 0001h
ANSELF_ANSELF6_MASK                      equ 0040h
ANSELF_ANSELF7_POSN                      equ 0007h
ANSELF_ANSELF7_POSITION                  equ 0007h
ANSELF_ANSELF7_SIZE                      equ 0001h
ANSELF_ANSELF7_LENGTH                    equ 0001h
ANSELF_ANSELF7_MASK                      equ 0080h

// Register: IOCGF
#define IOCGF IOCGF
IOCGF                                    equ 0EB5h
// bitfield definitions
IOCGF_IOCGF5_POSN                        equ 0005h
IOCGF_IOCGF5_POSITION                    equ 0005h
IOCGF_IOCGF5_SIZE                        equ 0001h
IOCGF_IOCGF5_LENGTH                      equ 0001h
IOCGF_IOCGF5_MASK                        equ 0020h

