GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
// Register: CCPR5
#define CCPR5 CCPR5
CCPR5                                    equ 0F1Ch

// Register: CCPR5L
#define CCPR5L CCPR5L
CCPR5L                                   equ 0F1Ch
// bitfield definitions
CCPR5L_RL_POSN                           equ 0000h
CCPR5L_RL_POSITION                       equ 0000h
CCPR5L_RL_SIZE                           equ 0008h
CCPR5L_RL_LENGTH                         equ 0008h
CCPR5L_RL_MASK                           equ 00FFh

// Register: CCPR5H
#define CCPR5H CCPR5H
CCPR5H                                   equ 0F1Dh
// bitfield definitions
CCPR5H_RH_POSN                           equ 0000h
CCPR5H_RH_POSITION                       equ 0000h
CCPR5H_RH_SIZE                           equ 0008h
CCPR5H_RH_LENGTH                         equ 0008h
CCPR5H_RH_MASK                           equ 00FFh

// Register: CCP5CON
#define CCP5CON CCP5CON
CCP5CON                                  equ 0F1Eh
// bitfield definitions
CCP5CON_MODE_POSN                        equ 0000h
CCP5CON_MODE_POSITION                    equ 0000h
CCP5CON_MODE_SIZE                        equ 0004h
CCP5CON_MODE_LENGTH                      equ 0004h
CCP5CON_MODE_MASK                        equ 000Fh
CCP5CON_FMT_POSN                         equ 0004h
CCP5CON_FMT_POSITION                     equ 0004h
CCP5CON_FMT_SIZE                         equ 0001h
CCP5CON_FMT_LENGTH                       equ 0001h
CCP5CON_FMT_MASK                         equ 0010h
CCP5CON_OUT_POSN                         equ 0005h
CCP5CON_OUT_POSITION                     equ 0005h
CCP5CON_OUT_SIZE                         equ 0001h
CCP5CON_OUT_LENGTH                       equ 0001h
CCP5CON_OUT_MASK                         equ 0020h
CCP5CON_OE_POSN                          equ 0006h
CCP5CON_OE_POSITION                      equ 0006h
CCP5CON_OE_SIZE                          equ 0001h
CCP5CON_OE_LENGTH                        equ 0001h
CCP5CON_OE_MASK                          equ 0040h
CCP5CON_EN_POSN                          equ 0007h
CCP5CON_EN_POSITION                      equ 0007h
CCP5CON_EN_SIZE                          equ 0001h
CCP5CON_EN_LENGTH                        equ 0001h
CCP5CON_EN_MASK                          equ 0080h
CCP5CON_MODE0_POSN                       equ 0000h
CCP5CON_MODE0_POSITION                   equ 0000h
CCP5CON_MODE0_SIZE                       equ 0001h
CCP5CON_MODE0_LENGTH                     equ 0001h
CCP5CON_MODE0_MASK                       equ 0001h
CCP5CON_MODE1_POSN                       equ 0001h
CCP5CON_MODE1_POSITION                   equ 0001h
CCP5CON_MODE1_SIZE                       equ 0001h
CCP5CON_MODE1_LENGTH                     equ 0001h
CCP5CON_MODE1_MASK                       equ 0002h
CCP5CON_MODE2_POSN                       equ 0002h
CCP5CON_MODE2_POSITION                   equ 0002h
CCP5CON_MODE2_SIZE                       equ 0001h
CCP5CON_MODE2_LENGTH                     equ 0001h
CCP5CON_MODE2_MASK                       equ 0004h
CCP5CON_MODE3_POSN                       equ 0003h
CCP5CON_MODE3_POSITION                   equ 0003h
CCP5CON_MODE3_SIZE                       equ 0001h
CCP5CON_MODE3_LENGTH                     equ 0001h
CCP5CON_MODE3_MASK                       equ 0008h
CCP5CON_CCP5MODE_POSN                    equ 0000h
CCP5CON_CCP5MODE_POSITION                equ 0000h
CCP5CON_CCP5MODE_SIZE                    equ 0004h
CCP5CON_CCP5MODE_LENGTH                  equ 0004h
CCP5CON_CCP5MODE_MASK                    equ 000Fh
CCP5CON_CCP5FMT_POSN                     equ 0004h
CCP5CON_CCP5FMT_POSITION                 equ 0004h
CCP5CON_CCP5FMT_SIZE                     equ 0001h
CCP5CON_CCP5FMT_LENGTH                   equ 0001h
CCP5CON_CCP5FMT_MASK                     equ 0010h
CCP5CON_CCP5OUT_POSN                     equ 0005h
CCP5CON_CCP5OUT_POSITION                 equ 0005h
CCP5CON_CCP5OUT_SIZE                     equ 0001h
CCP5CON_CCP5OUT_LENGTH                   equ 0001h
CCP5CON_CCP5OUT_MASK                     equ 0020h
CCP5CON_CCP5OE_POSN                      equ 0006h
CCP5CON_CCP5OE_POSITION                  equ 0006h
CCP5CON_CCP5OE_SIZE                      equ 0001h
CCP5CON_CCP5OE_LENGTH                    equ 0001h
CCP5CON_CCP5OE_MASK                      equ 0040h
CCP5CON_CCP5EN_POSN                      equ 0007h
CCP5CON_CCP5EN_POSITION                  equ 0007h
CCP5CON_CCP5EN_SIZE                      equ 0001h
CCP5CON_CCP5EN_LENGTH                    equ 0001h
CCP5CON_CCP5EN_MASK                      equ 0080h
CCP5CON_CCP5MODE0_POSN                   equ 0000h
CCP5CON_CCP5MODE0_POSITION               equ 0000h
CCP5CON_CCP5MODE0_SIZE                   equ 0001h
CCP5CON_CCP5MODE0_LENGTH                 equ 0001h
CCP5CON_CCP5MODE0_MASK                   equ 0001h
CCP5CON_CCP5MODE1_POSN                   equ 0001h
CCP5CON_CCP5MODE1_POSITION               equ 0001h
CCP5CON_CCP5MODE1_SIZE                   equ 0001h
CCP5CON_CCP5MODE1_LENGTH                 equ 0001h
CCP5CON_CCP5MODE1_MASK                   equ 0002h
CCP5CON_CCP5MODE2_POSN                   equ 0002h
CCP5CON_CCP5MODE2_POSITION               equ 0002h
CCP5CON_CCP5MODE2_SIZE                   equ 0001h
CCP5CON_CCP5MODE2_LENGTH                 equ 0001h
CCP5CON_CCP5MODE2_MASK                   equ 0004h
CCP5CON_CCP5MODE3_POSN                   equ 0003h
CCP5CON_CCP5MODE3_POSITION               equ 0003h
CCP5CON_CCP5MODE3_SIZE                   equ 0001h
CCP5CON_CCP5MODE3_LENGTH                 equ 0001h
CCP5CON_CCP5MODE3_MASK                   equ 0008h

// Register: CCP5CAP
#define CCP5CAP CCP5CAP
CCP5CAP                                  equ 0F1Fh
// bitfield definitions
CCP5CAP_CTS_POSN                         equ 0000h
CCP5CAP_CTS_POSITION                     equ 0000h
CCP5CAP_CTS_SIZE                         equ 0008h
CCP5CAP_CTS_LENGTH                       equ 0008h
CCP5CAP_CTS_MASK                         equ 00FFh
CCP5CAP_CTS0_POSN                        equ 0000h
CCP5CAP_CTS0_POSITION                    equ 0000h
CCP5CAP_CTS0_SIZE                        equ 0001h
CCP5CAP_CTS0_LENGTH                      equ 0001h
CCP5CAP_CTS0_MASK                        equ 0001h
CCP5CAP_CTS1_POSN                        equ 0001h
CCP5CAP_CTS1_POSITION                    equ 0001h
CCP5CAP_CTS1_SIZE                        equ 0001h
CCP5CAP_CTS1_LENGTH                      equ 0001h
CCP5CAP_CTS1_MASK                        equ 0002h
CCP5CAP_CTS2_POSN                        equ 0002h
CCP5CAP_CTS2_POSITION                    equ 0002h
CCP5CAP_CTS2_SIZE                        equ 0001h
CCP5CAP_CTS2_LENGTH                      equ 0001h
CCP5CAP_CTS2_MASK                        equ 0004h
CCP5CAP_CTS3_POSN                        equ 0003h
CCP5CAP_CTS3_POSITION                    equ 0003h
CCP5CAP_CTS3_SIZE                        equ 0001h
CCP5CAP_CTS3_LENGTH                      equ 0001h
CCP5CAP_CTS3_MASK                        equ 0008h
CCP5CAP_CTS4_POSN                        equ 0004h
CCP5CAP_CTS4_POSITION                    equ 0004h
CCP5CAP_CTS4_SIZE                        equ 0001h
CCP5CAP_CTS4_LENGTH                      equ 0001h
CCP5CAP_CTS4_MASK                        equ 0010h
CCP5CAP_CTS5_POSN                        equ 0005h
CCP5CAP_CTS5_POSITION                    equ 0005h
CCP5CAP_CTS5_SIZE                        equ 0001h
CCP5CAP_CTS5_LENGTH                      equ 0001h
CCP5CAP_CTS5_MASK                        equ 0020h
CCP5CAP_CTS6_POSN                        equ 0006h
CCP5CAP_CTS6_POSITION                    equ 0006h
CCP5CAP_CTS6_SIZE                        equ 0001h
CCP5CAP_CTS6_LENGTH                      equ 0001h
CCP5CAP_CTS6_MASK                        equ 0040h
CCP5CAP_CTS7_POSN                        equ 0007h
CCP5CAP_CTS7_POSITION                    equ 0007h
CCP5CAP_CTS7_SIZE                        equ 0001h
CCP5CAP_CTS7_LENGTH                      equ 0001h
CCP5CAP_CTS7_MASK                        equ 0080h
CCP5CAP_CCP5CTS_POSN                     equ 0000h
CCP5CAP_CCP5CTS_POSITION                 equ 0000h
CCP5CAP_CCP5CTS_SIZE                     equ 0008h
CCP5CAP_CCP5CTS_LENGTH                   equ 0008h
CCP5CAP_CCP5CTS_MASK                     equ 00FFh
CCP5CAP_CCP5CTS0_POSN                    equ 0000h
CCP5CAP_CCP5CTS0_POSITION                equ 0000h
CCP5CAP_CCP5CTS0_SIZE                    equ 0001h
CCP5CAP_CCP5CTS0_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS0_MASK                    equ 0001h
CCP5CAP_CCP5CTS1_POSN                    equ 0001h
CCP5CAP_CCP5CTS1_POSITION                equ 0001h
CCP5CAP_CCP5CTS1_SIZE                    equ 0001h
CCP5CAP_CCP5CTS1_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS1_MASK                    equ 0002h
CCP5CAP_CCP5CTS2_POSN                    equ 0002h
CCP5CAP_CCP5CTS2_POSITION                equ 0002h
CCP5CAP_CCP5CTS2_SIZE                    equ 0001h
CCP5CAP_CCP5CTS2_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS2_MASK                    equ 0004h
CCP5CAP_CCP5CTS3_POSN                    equ 0003h
CCP5CAP_CCP5CTS3_POSITION                equ 0003h
CCP5CAP_CCP5CTS3_SIZE                    equ 0001h
CCP5CAP_CCP5CTS3_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS3_MASK                    equ 0008h
CCP5CAP_CCP5CTS4_POSN                    equ 0004h
CCP5CAP_CCP5CTS4_POSITION                equ 0004h
CCP5CAP_CCP5CTS4_SIZE                    equ 0001h
CCP5CAP_CCP5CTS4_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS4_MASK                    equ 0010h
CCP5CAP_CCP5CTS5_POSN                    equ 0005h
CCP5CAP_CCP5CTS5_POSITION                equ 0005h
CCP5CAP_CCP5CTS5_SIZE                    equ 0001h
CCP5CAP_CCP5CTS5_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS5_MASK                    equ 0020h
CCP5CAP_CCP5CTS6_POSN                    equ 0006h
CCP5CAP_CCP5CTS6_POSITION                equ 0006h
CCP5CAP_CCP5CTS6_SIZE                    equ 0001h
CCP5CAP_CCP5CTS6_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS6_MASK                    equ 0040h
CCP5CAP_CCP5CTS7_POSN                    equ 0007h
CCP5CAP_CCP5CTS7_POSITION                equ 0007h
CCP5CAP_CCP5CTS7_SIZE                    equ 0001h
CCP5CAP_CCP5CTS7_LENGTH                  equ 0001h
CCP5CAP_CCP5CTS7_MASK                    equ 0080h

// Register: CCPR4
#define CCPR4 CCPR4
CCPR4                                    equ 0F20h

// Register: CCPR4L
#define CCPR4L CCPR4L
CCPR4L                                   equ 0F20h
// bitfield definitions
CCPR4L_RL_POSN                           equ 0000h
CCPR4L_RL_POSITION                       equ 0000h
CCPR4L_RL_SIZE                           equ 0008h
CCPR4L_RL_LENGTH                         equ 0008h
CCPR4L_RL_MASK                           equ 00FFh

// Register: CCPR4H
#define CCPR4H CCPR4H
CCPR4H                                   equ 0F21h
// bitfield definitions
CCPR4H_RH_POSN                           equ 0000h
CCPR4H_RH_POSITION                       equ 0000h
CCPR4H_RH_SIZE                           equ 0008h
CCPR4H_RH_LENGTH                         equ 0008h
CCPR4H_RH_MASK                           equ 00FFh

// Register: CCP4CON
#define CCP4CON CCP4CON
CCP4CON                                  equ 0F22h
// bitfield definitions
CCP4CON_MODE_POSN                        equ 0000h
CCP4CON_MODE_POSITION                    equ 0000h
CCP4CON_MODE_SIZE                        equ 0004h
CCP4CON_MODE_LENGTH                      equ 0004h
CCP4CON_MODE_MASK                        equ 000Fh
CCP4CON_FMT_POSN                         equ 0004h
CCP4CON_FMT_POSITION                     equ 0004h
CCP4CON_FMT_SIZE                         equ 0001h
CCP4CON_FMT_LENGTH                       equ 0001h
CCP4CON_FMT_MASK                         equ 0010h
CCP4CON_OUT_POSN                         equ 0005h
CCP4CON_OUT_POSITION                     equ 0005h
CCP4CON_OUT_SIZE                         equ 0001h
CCP4CON_OUT_LENGTH                       equ 0001h
CCP4CON_OUT_MASK                         equ 0020h
CCP4CON_OE_POSN                          equ 0006h
CCP4CON_OE_POSITION                      equ 0006h
CCP4CON_OE_SIZE                          equ 0001h
CCP4CON_OE_LENGTH                        equ 0001h
CCP4CON_OE_MASK                          equ 0040h
CCP4CON_EN_POSN                          equ 0007h
CCP4CON_EN_POSITION                      equ 0007h
CCP4CON_EN_SIZE                          equ 0001h
CCP4CON_EN_LENGTH                        equ 0001h
CCP4CON_EN_MASK                          equ 0080h
CCP4CON_MODE0_POSN                       equ 0000h
CCP4CON_MODE0_POSITION                   equ 0000h
CCP4CON_MODE0_SIZE                       equ 0001h
CCP4CON_MODE0_LENGTH                     equ 0001h
CCP4CON_MODE0_MASK                       equ 0001h
CCP4CON_MODE1_POSN                       equ 0001h
CCP4CON_MODE1_POSITION                   equ 0001h
CCP4CON_MODE1_SIZE                       equ 0001h
CCP4CON_MODE1_LENGTH                     equ 0001h
CCP4CON_MODE1_MASK                       equ 0002h
CCP4CON_MODE2_POSN                       equ 0002h
CCP4CON_MODE2_POSITION                   equ 0002h
CCP4CON_MODE2_SIZE                       equ 0001h
CCP4CON_MODE2_LENGTH                     equ 0001h
CCP4CON_MODE2_MASK                       equ 0004h
CCP4CON_MODE3_POSN                       equ 0003h
CCP4CON_MODE3_POSITION                   equ 0003h
CCP4CON_MODE3_SIZE                       equ 0001h
CCP4CON_MODE3_LENGTH                     equ 0001h
CCP4CON_MODE3_MASK                       equ 0008h
CCP4CON_CCP4MODE_POSN                    equ 0000h
CCP4CON_CCP4MODE_POSITION                equ 0000h
CCP4CON_CCP4MODE_SIZE                    equ 0004h
CCP4CON_CCP4MODE_LENGTH                  equ 0004h
CCP4CON_CCP4MODE_MASK                    equ 000Fh
CCP4CON_CCP4FMT_POSN                     equ 0004h
CCP4CON_CCP4FMT_POSITION                 equ 0004h
CCP4CON_CCP4FMT_SIZE                     equ 0001h
CCP4CON_CCP4FMT_LENGTH                   equ 0001h
CCP4CON_CCP4FMT_MASK                     equ 0010h
CCP4CON_CCP4OUT_POSN                     equ 0005h
CCP4CON_CCP4OUT_POSITION                 equ 0005h
CCP4CON_CCP4OUT_SIZE                     equ 0001h
CCP4CON_CCP4OUT_LENGTH                   equ 0001h
CCP4CON_CCP4OUT_MASK                     equ 0020h
CCP4CON_CCP4OE_POSN                      equ 0006h
CCP4CON_CCP4OE_POSITION                  equ 0006h
CCP4CON_CCP4OE_SIZE                      equ 0001h
CCP4CON_CCP4OE_LENGTH                    equ 0001h
CCP4CON_CCP4OE_MASK                      equ 0040h
CCP4CON_CCP4EN_POSN                      equ 0007h
CCP4CON_CCP4EN_POSITION                  equ 0007h
CCP4CON_CCP4EN_SIZE                      equ 0001h
CCP4CON_CCP4EN_LENGTH                    equ 0001h
CCP4CON_CCP4EN_MASK                      equ 0080h
CCP4CON_CCP4MODE0_POSN                   equ 0000h
CCP4CON_CCP4MODE0_POSITION               equ 0000h
CCP4CON_CCP4MODE0_SIZE                   equ 0001h
CCP4CON_CCP4MODE0_LENGTH                 equ 0001h
CCP4CON_CCP4MODE0_MASK                   equ 0001h
CCP4CON_CCP4MODE1_POSN                   equ 0001h
CCP4CON_CCP4MODE1_POSITION               equ 0001h
CCP4CON_CCP4MODE1_SIZE                   equ 0001h
CCP4CON_CCP4MODE1_LENGTH                 equ 0001h
CCP4CON_CCP4MODE1_MASK                   equ 0002h
CCP4CON_CCP4MODE2_POSN                   equ 0002h
CCP4CON_CCP4MODE2_POSITION               equ 0002h
CCP4CON_CCP4MODE2_SIZE                   equ 0001h
CCP4CON_CCP4MODE2_LENGTH                 equ 0001h
CCP4CON_CCP4MODE2_MASK                   equ 0004h
CCP4CON_CCP4MODE3_POSN                   equ 0003h
CCP4CON_CCP4MODE3_POSITION               equ 0003h
CCP4CON_CCP4MODE3_SIZE                   equ 0001h
CCP4CON_CCP4MODE3_LENGTH                 equ 0001h
CCP4CON_CCP4MODE3_MASK                   equ 0008h

