GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
// Register: T8HLT
#define T8HLT T8HLT
T8HLT                                    equ 0F2Bh
// bitfield definitions
T8HLT_MODE_POSN                          equ 0000h
T8HLT_MODE_POSITION                      equ 0000h
T8HLT_MODE_SIZE                          equ 0005h
T8HLT_MODE_LENGTH                        equ 0005h
T8HLT_MODE_MASK                          equ 001Fh
T8HLT_CKSYNC_POSN                        equ 0005h
T8HLT_CKSYNC_POSITION                    equ 0005h
T8HLT_CKSYNC_SIZE                        equ 0001h
T8HLT_CKSYNC_LENGTH                      equ 0001h
T8HLT_CKSYNC_MASK                        equ 0020h
T8HLT_CKPOL_POSN                         equ 0006h
T8HLT_CKPOL_POSITION                     equ 0006h
T8HLT_CKPOL_SIZE                         equ 0001h
T8HLT_CKPOL_LENGTH                       equ 0001h
T8HLT_CKPOL_MASK                         equ 0040h
T8HLT_PSYNC_POSN                         equ 0007h
T8HLT_PSYNC_POSITION                     equ 0007h
T8HLT_PSYNC_SIZE                         equ 0001h
T8HLT_PSYNC_LENGTH                       equ 0001h
T8HLT_PSYNC_MASK                         equ 0080h
T8HLT_MODE0_POSN                         equ 0000h
T8HLT_MODE0_POSITION                     equ 0000h
T8HLT_MODE0_SIZE                         equ 0001h
T8HLT_MODE0_LENGTH                       equ 0001h
T8HLT_MODE0_MASK                         equ 0001h
T8HLT_MODE1_POSN                         equ 0001h
T8HLT_MODE1_POSITION                     equ 0001h
T8HLT_MODE1_SIZE                         equ 0001h
T8HLT_MODE1_LENGTH                       equ 0001h
T8HLT_MODE1_MASK                         equ 0002h
T8HLT_MODE2_POSN                         equ 0002h
T8HLT_MODE2_POSITION                     equ 0002h
T8HLT_MODE2_SIZE                         equ 0001h
T8HLT_MODE2_LENGTH                       equ 0001h
T8HLT_MODE2_MASK                         equ 0004h
T8HLT_MODE3_POSN                         equ 0003h
T8HLT_MODE3_POSITION                     equ 0003h
T8HLT_MODE3_SIZE                         equ 0001h
T8HLT_MODE3_LENGTH                       equ 0001h
T8HLT_MODE3_MASK                         equ 0008h
T8HLT_MODE4_POSN                         equ 0004h
T8HLT_MODE4_POSITION                     equ 0004h
T8HLT_MODE4_SIZE                         equ 0001h
T8HLT_MODE4_LENGTH                       equ 0001h
T8HLT_MODE4_MASK                         equ 0010h
T8HLT_T8MODE_POSN                        equ 0000h
T8HLT_T8MODE_POSITION                    equ 0000h
T8HLT_T8MODE_SIZE                        equ 0005h
T8HLT_T8MODE_LENGTH                      equ 0005h
T8HLT_T8MODE_MASK                        equ 001Fh
T8HLT_T8CKSYNC_POSN                      equ 0005h
T8HLT_T8CKSYNC_POSITION                  equ 0005h
T8HLT_T8CKSYNC_SIZE                      equ 0001h
T8HLT_T8CKSYNC_LENGTH                    equ 0001h
T8HLT_T8CKSYNC_MASK                      equ 0020h
T8HLT_T8CKPOL_POSN                       equ 0006h
T8HLT_T8CKPOL_POSITION                   equ 0006h
T8HLT_T8CKPOL_SIZE                       equ 0001h
T8HLT_T8CKPOL_LENGTH                     equ 0001h
T8HLT_T8CKPOL_MASK                       equ 0040h
T8HLT_T8PSYNC_POSN                       equ 0007h
T8HLT_T8PSYNC_POSITION                   equ 0007h
T8HLT_T8PSYNC_SIZE                       equ 0001h
T8HLT_T8PSYNC_LENGTH                     equ 0001h
T8HLT_T8PSYNC_MASK                       equ 0080h
T8HLT_T8MODE0_POSN                       equ 0000h
T8HLT_T8MODE0_POSITION                   equ 0000h
T8HLT_T8MODE0_SIZE                       equ 0001h
T8HLT_T8MODE0_LENGTH                     equ 0001h
T8HLT_T8MODE0_MASK                       equ 0001h
T8HLT_T8MODE1_POSN                       equ 0001h
T8HLT_T8MODE1_POSITION                   equ 0001h
T8HLT_T8MODE1_SIZE                       equ 0001h
T8HLT_T8MODE1_LENGTH                     equ 0001h
T8HLT_T8MODE1_MASK                       equ 0002h
T8HLT_T8MODE2_POSN                       equ 0002h
T8HLT_T8MODE2_POSITION                   equ 0002h
T8HLT_T8MODE2_SIZE                       equ 0001h
T8HLT_T8MODE2_LENGTH                     equ 0001h
T8HLT_T8MODE2_MASK                       equ 0004h
T8HLT_T8MODE3_POSN                       equ 0003h
T8HLT_T8MODE3_POSITION                   equ 0003h
T8HLT_T8MODE3_SIZE                       equ 0001h
T8HLT_T8MODE3_LENGTH                     equ 0001h
T8HLT_T8MODE3_MASK                       equ 0008h
T8HLT_T8MODE4_POSN                       equ 0004h
T8HLT_T8MODE4_POSITION                   equ 0004h
T8HLT_T8MODE4_SIZE                       equ 0001h
T8HLT_T8MODE4_LENGTH                     equ 0001h
T8HLT_T8MODE4_MASK                       equ 0010h

// Register: T8CLKCON
#define T8CLKCON T8CLKCON
T8CLKCON                                 equ 0F2Ch
// bitfield definitions
T8CLKCON_CS_POSN                         equ 0000h
T8CLKCON_CS_POSITION                     equ 0000h
T8CLKCON_CS_SIZE                         equ 0004h
T8CLKCON_CS_LENGTH                       equ 0004h
T8CLKCON_CS_MASK                         equ 000Fh
T8CLKCON_CS0_POSN                        equ 0000h
T8CLKCON_CS0_POSITION                    equ 0000h
T8CLKCON_CS0_SIZE                        equ 0001h
T8CLKCON_CS0_LENGTH                      equ 0001h
T8CLKCON_CS0_MASK                        equ 0001h
T8CLKCON_CS1_POSN                        equ 0001h
T8CLKCON_CS1_POSITION                    equ 0001h
T8CLKCON_CS1_SIZE                        equ 0001h
T8CLKCON_CS1_LENGTH                      equ 0001h
T8CLKCON_CS1_MASK                        equ 0002h
T8CLKCON_CS2_POSN                        equ 0002h
T8CLKCON_CS2_POSITION                    equ 0002h
T8CLKCON_CS2_SIZE                        equ 0001h
T8CLKCON_CS2_LENGTH                      equ 0001h
T8CLKCON_CS2_MASK                        equ 0004h
T8CLKCON_CS3_POSN                        equ 0003h
T8CLKCON_CS3_POSITION                    equ 0003h
T8CLKCON_CS3_SIZE                        equ 0001h
T8CLKCON_CS3_LENGTH                      equ 0001h
T8CLKCON_CS3_MASK                        equ 0008h
T8CLKCON_T8CS_POSN                       equ 0000h
T8CLKCON_T8CS_POSITION                   equ 0000h
T8CLKCON_T8CS_SIZE                       equ 0004h
T8CLKCON_T8CS_LENGTH                     equ 0004h
T8CLKCON_T8CS_MASK                       equ 000Fh
T8CLKCON_T8CS0_POSN                      equ 0000h
T8CLKCON_T8CS0_POSITION                  equ 0000h
T8CLKCON_T8CS0_SIZE                      equ 0001h
T8CLKCON_T8CS0_LENGTH                    equ 0001h
T8CLKCON_T8CS0_MASK                      equ 0001h
T8CLKCON_T8CS1_POSN                      equ 0001h
T8CLKCON_T8CS1_POSITION                  equ 0001h
T8CLKCON_T8CS1_SIZE                      equ 0001h
T8CLKCON_T8CS1_LENGTH                    equ 0001h
T8CLKCON_T8CS1_MASK                      equ 0002h
T8CLKCON_T8CS2_POSN                      equ 0002h
T8CLKCON_T8CS2_POSITION                  equ 0002h
T8CLKCON_T8CS2_SIZE                      equ 0001h
T8CLKCON_T8CS2_LENGTH                    equ 0001h
T8CLKCON_T8CS2_MASK                      equ 0004h
T8CLKCON_T8CS3_POSN                      equ 0003h
T8CLKCON_T8CS3_POSITION                  equ 0003h
T8CLKCON_T8CS3_SIZE                      equ 0001h
T8CLKCON_T8CS3_LENGTH                    equ 0001h
T8CLKCON_T8CS3_MASK                      equ 0008h

// Register: T8RST
#define T8RST T8RST
T8RST                                    equ 0F2Dh
// bitfield definitions
T8RST_RSEL_POSN                          equ 0000h
T8RST_RSEL_POSITION                      equ 0000h
T8RST_RSEL_SIZE                          equ 0004h
T8RST_RSEL_LENGTH                        equ 0004h
T8RST_RSEL_MASK                          equ 000Fh
T8RST_RSEL0_POSN                         equ 0000h
T8RST_RSEL0_POSITION                     equ 0000h
T8RST_RSEL0_SIZE                         equ 0001h
T8RST_RSEL0_LENGTH                       equ 0001h
T8RST_RSEL0_MASK                         equ 0001h
T8RST_RSEL1_POSN                         equ 0001h
T8RST_RSEL1_POSITION                     equ 0001h
T8RST_RSEL1_SIZE                         equ 0001h
T8RST_RSEL1_LENGTH                       equ 0001h
T8RST_RSEL1_MASK                         equ 0002h
T8RST_RSEL2_POSN                         equ 0002h
T8RST_RSEL2_POSITION                     equ 0002h
T8RST_RSEL2_SIZE                         equ 0001h
T8RST_RSEL2_LENGTH                       equ 0001h
T8RST_RSEL2_MASK                         equ 0004h
T8RST_RSEL3_POSN                         equ 0003h
T8RST_RSEL3_POSITION                     equ 0003h
T8RST_RSEL3_SIZE                         equ 0001h
T8RST_RSEL3_LENGTH                       equ 0001h
T8RST_RSEL3_MASK                         equ 0008h
T8RST_T8RSEL_POSN                        equ 0000h
T8RST_T8RSEL_POSITION                    equ 0000h
T8RST_T8RSEL_SIZE                        equ 0004h
T8RST_T8RSEL_LENGTH                      equ 0004h
T8RST_T8RSEL_MASK                        equ 000Fh
T8RST_T8RSEL0_POSN                       equ 0000h
T8RST_T8RSEL0_POSITION                   equ 0000h
T8RST_T8RSEL0_SIZE                       equ 0001h
T8RST_T8RSEL0_LENGTH                     equ 0001h
T8RST_T8RSEL0_MASK                       equ 0001h
T8RST_T8RSEL1_POSN                       equ 0001h
T8RST_T8RSEL1_POSITION                   equ 0001h
T8RST_T8RSEL1_SIZE                       equ 0001h
T8RST_T8RSEL1_LENGTH                     equ 0001h
T8RST_T8RSEL1_MASK                       equ 0002h
T8RST_T8RSEL2_POSN                       equ 0002h
T8RST_T8RSEL2_POSITION                   equ 0002h
T8RST_T8RSEL2_SIZE                       equ 0001h
T8RST_T8RSEL2_LENGTH                     equ 0001h
T8RST_T8RSEL2_MASK                       equ 0004h
T8RST_T8RSEL3_POSN                       equ 0003h
T8RST_T8RSEL3_POSITION                   equ 0003h
T8RST_T8RSEL3_SIZE                       equ 0001h
T8RST_T8RSEL3_LENGTH                     equ 0001h
T8RST_T8RSEL3_MASK                       equ 0008h

// Register: TMR7
#define TMR7 TMR7
TMR7                                     equ 0F2Eh

// Register: TMR7L
#define TMR7L TMR7L
TMR7L                                    equ 0F2Eh
// bitfield definitions
TMR7L_TMR7L0_POSN                        equ 0000h
TMR7L_TMR7L0_POSITION                    equ 0000h
TMR7L_TMR7L0_SIZE                        equ 0001h
TMR7L_TMR7L0_LENGTH                      equ 0001h
TMR7L_TMR7L0_MASK                        equ 0001h
TMR7L_TMR7L1_POSN                        equ 0001h
TMR7L_TMR7L1_POSITION                    equ 0001h
TMR7L_TMR7L1_SIZE                        equ 0001h
TMR7L_TMR7L1_LENGTH                      equ 0001h
TMR7L_TMR7L1_MASK                        equ 0002h
TMR7L_TMR7L2_POSN                        equ 0002h
TMR7L_TMR7L2_POSITION                    equ 0002h
TMR7L_TMR7L2_SIZE                        equ 0001h
TMR7L_TMR7L2_LENGTH                      equ 0001h
TMR7L_TMR7L2_MASK                        equ 0004h
TMR7L_TMR7L3_POSN                        equ 0003h
TMR7L_TMR7L3_POSITION                    equ 0003h
TMR7L_TMR7L3_SIZE                        equ 0001h
TMR7L_TMR7L3_LENGTH                      equ 0001h
TMR7L_TMR7L3_MASK                        equ 0008h
TMR7L_TMR7L4_POSN                        equ 0004h
TMR7L_TMR7L4_POSITION                    equ 0004h
TMR7L_TMR7L4_SIZE                        equ 0001h
TMR7L_TMR7L4_LENGTH                      equ 0001h
TMR7L_TMR7L4_MASK                        equ 0010h
TMR7L_TMR7L5_POSN                        equ 0005h
TMR7L_TMR7L5_POSITION                    equ 0005h
TMR7L_TMR7L5_SIZE                        equ 0001h
TMR7L_TMR7L5_LENGTH                      equ 0001h
TMR7L_TMR7L5_MASK                        equ 0020h
TMR7L_TMR7L6_POSN                        equ 0006h
TMR7L_TMR7L6_POSITION                    equ 0006h
TMR7L_TMR7L6_SIZE                        equ 0001h
TMR7L_TMR7L6_LENGTH                      equ 0001h
TMR7L_TMR7L6_MASK                        equ 0040h
TMR7L_TMR7L7_POSN                        equ 0007h
TMR7L_TMR7L7_POSITION                    equ 0007h
TMR7L_TMR7L7_SIZE                        equ 0001h
TMR7L_TMR7L7_LENGTH                      equ 0001h
TMR7L_TMR7L7_MASK                        equ 0080h
TMR7L_TMR7L_POSN                         equ 0000h
TMR7L_TMR7L_POSITION                     equ 0000h
TMR7L_TMR7L_SIZE                         equ 0008h
TMR7L_TMR7L_LENGTH                       equ 0008h
TMR7L_TMR7L_MASK                         equ 00FFh
TMR7L_TMR70_POSN                         equ 0000h
TMR7L_TMR70_POSITION                     equ 0000h
TMR7L_TMR70_SIZE                         equ 0001h
TMR7L_TMR70_LENGTH                       equ 0001h
TMR7L_TMR70_MASK                         equ 0001h
TMR7L_TMR71_POSN                         equ 0001h
TMR7L_TMR71_POSITION                     equ 0001h
TMR7L_TMR71_SIZE                         equ 0001h
TMR7L_TMR71_LENGTH                       equ 0001h
TMR7L_TMR71_MASK                         equ 0002h
TMR7L_TMR72_POSN                         equ 0002h
TMR7L_TMR72_POSITION                     equ 0002h
TMR7L_TMR72_SIZE                         equ 0001h
TMR7L_TMR72_LENGTH                       equ 0001h
TMR7L_TMR72_MASK                         equ 0004h
TMR7L_TMR73_POSN                         equ 0003h
TMR7L_TMR73_POSITION                     equ 0003h
TMR7L_TMR73_SIZE                         equ 0001h
TMR7L_TMR73_LENGTH                       equ 0001h
TMR7L_TMR73_MASK                         equ 0008h
TMR7L_TMR74_POSN                         equ 0004h
TMR7L_TMR74_POSITION                     equ 0004h
TMR7L_TMR74_SIZE                         equ 0001h
TMR7L_TMR74_LENGTH                       equ 0001h
TMR7L_TMR74_MASK                         equ 0010h
TMR7L_TMR75_POSN                         equ 0005h
TMR7L_TMR75_POSITION                     equ 0005h
TMR7L_TMR75_SIZE                         equ 0001h
TMR7L_TMR75_LENGTH                       equ 0001h
TMR7L_TMR75_MASK                         equ 0020h
TMR7L_TMR76_POSN                         equ 0006h
TMR7L_TMR76_POSITION                     equ 0006h
TMR7L_TMR76_SIZE                         equ 0001h
TMR7L_TMR76_LENGTH                       equ 0001h
TMR7L_TMR76_MASK                         equ 0040h
TMR7L_TMR77_POSN                         equ 0007h
TMR7L_TMR77_POSITION                     equ 0007h
TMR7L_TMR77_SIZE                         equ 0001h
TMR7L_TMR77_LENGTH                       equ 0001h
TMR7L_TMR77_MASK                         equ 0080h
TMR7L_CAL07_POSN                         equ 0000h
TMR7L_CAL07_POSITION                     equ 0000h
TMR7L_CAL07_SIZE                         equ 0001h
TMR7L_CAL07_LENGTH                       equ 0001h
TMR7L_CAL07_MASK                         equ 0001h
TMR7L_CAL17_POSN                         equ 0001h
TMR7L_CAL17_POSITION                     equ 0001h
TMR7L_CAL17_SIZE                         equ 0001h
TMR7L_CAL17_LENGTH                       equ 0001h
TMR7L_CAL17_MASK                         equ 0002h
TMR7L_CAL27_POSN                         equ 0002h
TMR7L_CAL27_POSITION                     equ 0002h
TMR7L_CAL27_SIZE                         equ 0001h
TMR7L_CAL27_LENGTH                       equ 0001h
TMR7L_CAL27_MASK                         equ 0004h
TMR7L_CAL37_POSN                         equ 0003h
TMR7L_CAL37_POSITION                     equ 0003h
TMR7L_CAL37_SIZE                         equ 0001h
TMR7L_CAL37_LENGTH                       equ 0001h
TMR7L_CAL37_MASK                         equ 0008h
TMR7L_CAL47_POSN                         equ 0004h
TMR7L_CAL47_POSITION                     equ 0004h
TMR7L_CAL47_SIZE                         equ 0001h
TMR7L_CAL47_LENGTH                       equ 0001h
TMR7L_CAL47_MASK                         equ 0010h
TMR7L_CAL57_POSN                         equ 0005h
TMR7L_CAL57_POSITION                     equ 0005h
TMR7L_CAL57_SIZE                         equ 0001h
TMR7L_CAL57_LENGTH                       equ 0001h
TMR7L_CAL57_MASK                         equ 0020h
TMR7L_CAL67_POSN                         equ 0006h
TMR7L_CAL67_POSITION                     equ 0006h
TMR7L_CAL67_SIZE                         equ 0001h
TMR7L_CAL67_LENGTH                       equ 0001h
TMR7L_CAL67_MASK                         equ 0040h
TMR7L_CAL77_POSN                         equ 0007h
TMR7L_CAL77_POSITION                     equ 0007h
TMR7L_CAL77_SIZE                         equ 0001h
TMR7L_CAL77_LENGTH                       equ 0001h
TMR7L_CAL77_MASK                         equ 0080h

