GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
// Register: T7CLK
#define T7CLK T7CLK
T7CLK                                    equ 0F33h
// bitfield definitions
T7CLK_CS_POSN                            equ 0000h
T7CLK_CS_POSITION                        equ 0000h
T7CLK_CS_SIZE                            equ 0004h
T7CLK_CS_LENGTH                          equ 0004h
T7CLK_CS_MASK                            equ 000Fh
T7CLK_T7CS0_POSN                         equ 0000h
T7CLK_T7CS0_POSITION                     equ 0000h
T7CLK_T7CS0_SIZE                         equ 0001h
T7CLK_T7CS0_LENGTH                       equ 0001h
T7CLK_T7CS0_MASK                         equ 0001h
T7CLK_T7CS1_POSN                         equ 0001h
T7CLK_T7CS1_POSITION                     equ 0001h
T7CLK_T7CS1_SIZE                         equ 0001h
T7CLK_T7CS1_LENGTH                       equ 0001h
T7CLK_T7CS1_MASK                         equ 0002h
T7CLK_T7CS2_POSN                         equ 0002h
T7CLK_T7CS2_POSITION                     equ 0002h
T7CLK_T7CS2_SIZE                         equ 0001h
T7CLK_T7CS2_LENGTH                       equ 0001h
T7CLK_T7CS2_MASK                         equ 0004h
T7CLK_T7CS3_POSN                         equ 0003h
T7CLK_T7CS3_POSITION                     equ 0003h
T7CLK_T7CS3_SIZE                         equ 0001h
T7CLK_T7CS3_LENGTH                       equ 0001h
T7CLK_T7CS3_MASK                         equ 0008h
T7CLK_CS0_POSN                           equ 0000h
T7CLK_CS0_POSITION                       equ 0000h
T7CLK_CS0_SIZE                           equ 0001h
T7CLK_CS0_LENGTH                         equ 0001h
T7CLK_CS0_MASK                           equ 0001h
T7CLK_CS1_POSN                           equ 0001h
T7CLK_CS1_POSITION                       equ 0001h
T7CLK_CS1_SIZE                           equ 0001h
T7CLK_CS1_LENGTH                         equ 0001h
T7CLK_CS1_MASK                           equ 0002h
T7CLK_CS2_POSN                           equ 0002h
T7CLK_CS2_POSITION                       equ 0002h
T7CLK_CS2_SIZE                           equ 0001h
T7CLK_CS2_LENGTH                         equ 0001h
T7CLK_CS2_MASK                           equ 0004h
T7CLK_CS3_POSN                           equ 0003h
T7CLK_CS3_POSITION                       equ 0003h
T7CLK_CS3_SIZE                           equ 0001h
T7CLK_CS3_LENGTH                         equ 0001h
T7CLK_CS3_MASK                           equ 0008h

// Register: CLKRCON
#define CLKRCON CLKRCON
CLKRCON                                  equ 0F34h
// bitfield definitions
CLKRCON_DIV_POSN                         equ 0000h
CLKRCON_DIV_POSITION                     equ 0000h
CLKRCON_DIV_SIZE                         equ 0003h
CLKRCON_DIV_LENGTH                       equ 0003h
CLKRCON_DIV_MASK                         equ 0007h
CLKRCON_DC_POSN                          equ 0003h
CLKRCON_DC_POSITION                      equ 0003h
CLKRCON_DC_SIZE                          equ 0002h
CLKRCON_DC_LENGTH                        equ 0002h
CLKRCON_DC_MASK                          equ 0018h
CLKRCON_EN_POSN                          equ 0007h
CLKRCON_EN_POSITION                      equ 0007h
CLKRCON_EN_SIZE                          equ 0001h
CLKRCON_EN_LENGTH                        equ 0001h
CLKRCON_EN_MASK                          equ 0080h
CLKRCON_CLKRDIV0_POSN                    equ 0000h
CLKRCON_CLKRDIV0_POSITION                equ 0000h
CLKRCON_CLKRDIV0_SIZE                    equ 0001h
CLKRCON_CLKRDIV0_LENGTH                  equ 0001h
CLKRCON_CLKRDIV0_MASK                    equ 0001h
CLKRCON_CLKRDIV1_POSN                    equ 0001h
CLKRCON_CLKRDIV1_POSITION                equ 0001h
CLKRCON_CLKRDIV1_SIZE                    equ 0001h
CLKRCON_CLKRDIV1_LENGTH                  equ 0001h
CLKRCON_CLKRDIV1_MASK                    equ 0002h
CLKRCON_CLKRDIV2_POSN                    equ 0002h
CLKRCON_CLKRDIV2_POSITION                equ 0002h
CLKRCON_CLKRDIV2_SIZE                    equ 0001h
CLKRCON_CLKRDIV2_LENGTH                  equ 0001h
CLKRCON_CLKRDIV2_MASK                    equ 0004h
CLKRCON_CLKRDC0_POSN                     equ 0003h
CLKRCON_CLKRDC0_POSITION                 equ 0003h
CLKRCON_CLKRDC0_SIZE                     equ 0001h
CLKRCON_CLKRDC0_LENGTH                   equ 0001h
CLKRCON_CLKRDC0_MASK                     equ 0008h
CLKRCON_CLKRDC1_POSN                     equ 0004h
CLKRCON_CLKRDC1_POSITION                 equ 0004h
CLKRCON_CLKRDC1_SIZE                     equ 0001h
CLKRCON_CLKRDC1_LENGTH                   equ 0001h
CLKRCON_CLKRDC1_MASK                     equ 0010h
CLKRCON_CLKREN_POSN                      equ 0007h
CLKRCON_CLKREN_POSITION                  equ 0007h
CLKRCON_CLKREN_SIZE                      equ 0001h
CLKRCON_CLKREN_LENGTH                    equ 0001h
CLKRCON_CLKREN_MASK                      equ 0080h
CLKRCON_DIV0_POSN                        equ 0000h
CLKRCON_DIV0_POSITION                    equ 0000h
CLKRCON_DIV0_SIZE                        equ 0001h
CLKRCON_DIV0_LENGTH                      equ 0001h
CLKRCON_DIV0_MASK                        equ 0001h
CLKRCON_DIV1_POSN                        equ 0001h
CLKRCON_DIV1_POSITION                    equ 0001h
CLKRCON_DIV1_SIZE                        equ 0001h
CLKRCON_DIV1_LENGTH                      equ 0001h
CLKRCON_DIV1_MASK                        equ 0002h
CLKRCON_DIV2_POSN                        equ 0002h
CLKRCON_DIV2_POSITION                    equ 0002h
CLKRCON_DIV2_SIZE                        equ 0001h
CLKRCON_DIV2_LENGTH                      equ 0001h
CLKRCON_DIV2_MASK                        equ 0004h
CLKRCON_DC0_POSN                         equ 0003h
CLKRCON_DC0_POSITION                     equ 0003h
CLKRCON_DC0_SIZE                         equ 0001h
CLKRCON_DC0_LENGTH                       equ 0001h
CLKRCON_DC0_MASK                         equ 0008h
CLKRCON_DC1_POSN                         equ 0004h
CLKRCON_DC1_POSITION                     equ 0004h
CLKRCON_DC1_SIZE                         equ 0001h
CLKRCON_DC1_LENGTH                       equ 0001h
CLKRCON_DC1_MASK                         equ 0010h

