GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
// Register: ADFLTRL
#define ADFLTRL ADFLTRL
ADFLTRL                                  equ 0F72h
// bitfield definitions
ADFLTRL_ADFLTRL_POSN                     equ 0000h
ADFLTRL_ADFLTRL_POSITION                 equ 0000h
ADFLTRL_ADFLTRL_SIZE                     equ 0008h
ADFLTRL_ADFLTRL_LENGTH                   equ 0008h
ADFLTRL_ADFLTRL_MASK                     equ 00FFh
ADFLTRL_ADFLTR0_POSN                     equ 0000h
ADFLTRL_ADFLTR0_POSITION                 equ 0000h
ADFLTRL_ADFLTR0_SIZE                     equ 0001h
ADFLTRL_ADFLTR0_LENGTH                   equ 0001h
ADFLTRL_ADFLTR0_MASK                     equ 0001h
ADFLTRL_ADFLTR1_POSN                     equ 0001h
ADFLTRL_ADFLTR1_POSITION                 equ 0001h
ADFLTRL_ADFLTR1_SIZE                     equ 0001h
ADFLTRL_ADFLTR1_LENGTH                   equ 0001h
ADFLTRL_ADFLTR1_MASK                     equ 0002h
ADFLTRL_ADFLTR2_POSN                     equ 0002h
ADFLTRL_ADFLTR2_POSITION                 equ 0002h
ADFLTRL_ADFLTR2_SIZE                     equ 0001h
ADFLTRL_ADFLTR2_LENGTH                   equ 0001h
ADFLTRL_ADFLTR2_MASK                     equ 0004h
ADFLTRL_ADFLTR3_POSN                     equ 0003h
ADFLTRL_ADFLTR3_POSITION                 equ 0003h
ADFLTRL_ADFLTR3_SIZE                     equ 0001h
ADFLTRL_ADFLTR3_LENGTH                   equ 0001h
ADFLTRL_ADFLTR3_MASK                     equ 0008h
ADFLTRL_ADFLTR4_POSN                     equ 0004h
ADFLTRL_ADFLTR4_POSITION                 equ 0004h
ADFLTRL_ADFLTR4_SIZE                     equ 0001h
ADFLTRL_ADFLTR4_LENGTH                   equ 0001h
ADFLTRL_ADFLTR4_MASK                     equ 0010h
ADFLTRL_ADFLTR5_POSN                     equ 0005h
ADFLTRL_ADFLTR5_POSITION                 equ 0005h
ADFLTRL_ADFLTR5_SIZE                     equ 0001h
ADFLTRL_ADFLTR5_LENGTH                   equ 0001h
ADFLTRL_ADFLTR5_MASK                     equ 0020h
ADFLTRL_ADFLTR6_POSN                     equ 0006h
ADFLTRL_ADFLTR6_POSITION                 equ 0006h
ADFLTRL_ADFLTR6_SIZE                     equ 0001h
ADFLTRL_ADFLTR6_LENGTH                   equ 0001h
ADFLTRL_ADFLTR6_MASK                     equ 0040h
ADFLTRL_ADFLTR7_POSN                     equ 0007h
ADFLTRL_ADFLTR7_POSITION                 equ 0007h
ADFLTRL_ADFLTR7_SIZE                     equ 0001h
ADFLTRL_ADFLTR7_LENGTH                   equ 0001h
ADFLTRL_ADFLTR7_MASK                     equ 0080h

// Register: ADFLTRH
#define ADFLTRH ADFLTRH
ADFLTRH                                  equ 0F73h
// bitfield definitions
ADFLTRH_ADFLTRH_POSN                     equ 0000h
ADFLTRH_ADFLTRH_POSITION                 equ 0000h
ADFLTRH_ADFLTRH_SIZE                     equ 0008h
ADFLTRH_ADFLTRH_LENGTH                   equ 0008h
ADFLTRH_ADFLTRH_MASK                     equ 00FFh
ADFLTRH_ADFLTR8_POSN                     equ 0000h
ADFLTRH_ADFLTR8_POSITION                 equ 0000h
ADFLTRH_ADFLTR8_SIZE                     equ 0001h
ADFLTRH_ADFLTR8_LENGTH                   equ 0001h
ADFLTRH_ADFLTR8_MASK                     equ 0001h
ADFLTRH_ADFLTR9_POSN                     equ 0001h
ADFLTRH_ADFLTR9_POSITION                 equ 0001h
ADFLTRH_ADFLTR9_SIZE                     equ 0001h
ADFLTRH_ADFLTR9_LENGTH                   equ 0001h
ADFLTRH_ADFLTR9_MASK                     equ 0002h
ADFLTRH_ADFLTR10_POSN                    equ 0002h
ADFLTRH_ADFLTR10_POSITION                equ 0002h
ADFLTRH_ADFLTR10_SIZE                    equ 0001h
ADFLTRH_ADFLTR10_LENGTH                  equ 0001h
ADFLTRH_ADFLTR10_MASK                    equ 0004h
ADFLTRH_ADFLTR11_POSN                    equ 0003h
ADFLTRH_ADFLTR11_POSITION                equ 0003h
ADFLTRH_ADFLTR11_SIZE                    equ 0001h
ADFLTRH_ADFLTR11_LENGTH                  equ 0001h
ADFLTRH_ADFLTR11_MASK                    equ 0008h
ADFLTRH_ADFLTR12_POSN                    equ 0004h
ADFLTRH_ADFLTR12_POSITION                equ 0004h
ADFLTRH_ADFLTR12_SIZE                    equ 0001h
ADFLTRH_ADFLTR12_LENGTH                  equ 0001h
ADFLTRH_ADFLTR12_MASK                    equ 0010h
ADFLTRH_ADFLTR13_POSN                    equ 0005h
ADFLTRH_ADFLTR13_POSITION                equ 0005h
ADFLTRH_ADFLTR13_SIZE                    equ 0001h
ADFLTRH_ADFLTR13_LENGTH                  equ 0001h
ADFLTRH_ADFLTR13_MASK                    equ 0020h
ADFLTRH_ADFLTR14_POSN                    equ 0006h
ADFLTRH_ADFLTR14_POSITION                equ 0006h
ADFLTRH_ADFLTR14_SIZE                    equ 0001h
ADFLTRH_ADFLTR14_LENGTH                  equ 0001h
ADFLTRH_ADFLTR14_MASK                    equ 0040h
ADFLTRH_ADFLTR15_POSN                    equ 0007h
ADFLTRH_ADFLTR15_POSITION                equ 0007h
ADFLTRH_ADFLTR15_SIZE                    equ 0001h
ADFLTRH_ADFLTR15_LENGTH                  equ 0001h
ADFLTRH_ADFLTR15_MASK                    equ 0080h

// Register: NVMADR
#define NVMADR NVMADR
NVMADR                                   equ 0F74h

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 0F74h
// bitfield definitions
NVMADRL_ADR_POSN                         equ 0000h
NVMADRL_ADR_POSITION                     equ 0000h
NVMADRL_ADR_SIZE                         equ 0008h
NVMADRL_ADR_LENGTH                       equ 0008h
NVMADRL_ADR_MASK                         equ 00FFh
NVMADRL_ADR0_POSN                        equ 0000h
NVMADRL_ADR0_POSITION                    equ 0000h
NVMADRL_ADR0_SIZE                        equ 0001h
NVMADRL_ADR0_LENGTH                      equ 0001h
NVMADRL_ADR0_MASK                        equ 0001h
NVMADRL_ADR1_POSN                        equ 0001h
NVMADRL_ADR1_POSITION                    equ 0001h
NVMADRL_ADR1_SIZE                        equ 0001h
NVMADRL_ADR1_LENGTH                      equ 0001h
NVMADRL_ADR1_MASK                        equ 0002h
NVMADRL_ADR2_POSN                        equ 0002h
NVMADRL_ADR2_POSITION                    equ 0002h
NVMADRL_ADR2_SIZE                        equ 0001h
NVMADRL_ADR2_LENGTH                      equ 0001h
NVMADRL_ADR2_MASK                        equ 0004h
NVMADRL_ADR3_POSN                        equ 0003h
NVMADRL_ADR3_POSITION                    equ 0003h
NVMADRL_ADR3_SIZE                        equ 0001h
NVMADRL_ADR3_LENGTH                      equ 0001h
NVMADRL_ADR3_MASK                        equ 0008h
NVMADRL_ADR4_POSN                        equ 0004h
NVMADRL_ADR4_POSITION                    equ 0004h
NVMADRL_ADR4_SIZE                        equ 0001h
NVMADRL_ADR4_LENGTH                      equ 0001h
NVMADRL_ADR4_MASK                        equ 0010h
NVMADRL_ADR5_POSN                        equ 0005h
NVMADRL_ADR5_POSITION                    equ 0005h
NVMADRL_ADR5_SIZE                        equ 0001h
NVMADRL_ADR5_LENGTH                      equ 0001h
NVMADRL_ADR5_MASK                        equ 0020h
NVMADRL_ADR6_POSN                        equ 0006h
NVMADRL_ADR6_POSITION                    equ 0006h
NVMADRL_ADR6_SIZE                        equ 0001h
NVMADRL_ADR6_LENGTH                      equ 0001h
NVMADRL_ADR6_MASK                        equ 0040h
NVMADRL_ADR7_POSN                        equ 0007h
NVMADRL_ADR7_POSITION                    equ 0007h
NVMADRL_ADR7_SIZE                        equ 0001h
NVMADRL_ADR7_LENGTH                      equ 0001h
NVMADRL_ADR7_MASK                        equ 0080h
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h
NVMADRL_ADRL_POSN                        equ 0000h
NVMADRL_ADRL_POSITION                    equ 0000h
NVMADRL_ADRL_SIZE                        equ 0008h
NVMADRL_ADRL_LENGTH                      equ 0008h
NVMADRL_ADRL_MASK                        equ 00FFh

