GopalSaraf/Practicals/PSDL/include/proc/pic18f67k40.inc
#define ANSELA3                          BANKMASK(ANSELA), 3, b
#define ANSELA4                          BANKMASK(ANSELA), 4, b
#define ANSELA5                          BANKMASK(ANSELA), 5, b
#define ANSELA6                          BANKMASK(ANSELA), 6, b
#define ANSELA7                          BANKMASK(ANSELA), 7, b
#define ANSELB0                          BANKMASK(ANSELB), 0, b
#define ANSELB1                          BANKMASK(ANSELB), 1, b
#define ANSELB2                          BANKMASK(ANSELB), 2, b
#define ANSELB3                          BANKMASK(ANSELB), 3, b
#define ANSELB4                          BANKMASK(ANSELB), 4, b
#define ANSELB5                          BANKMASK(ANSELB), 5, b
#define ANSELB6                          BANKMASK(ANSELB), 6, b
#define ANSELB7                          BANKMASK(ANSELB), 7, b
#define ANSELD0                          BANKMASK(ANSELD), 0, b
#define ANSELD1                          BANKMASK(ANSELD), 1, b
#define ANSELD2                          BANKMASK(ANSELD), 2, b
#define ANSELD3                          BANKMASK(ANSELD), 3, b
#define ANSELD4                          BANKMASK(ANSELD), 4, b
#define ANSELD5                          BANKMASK(ANSELD), 5, b
#define ANSELD6                          BANKMASK(ANSELD), 6, b
#define ANSELD7                          BANKMASK(ANSELD), 7, b
#define ANSELE0                          BANKMASK(ANSELE), 0, b
#define ANSELE1                          BANKMASK(ANSELE), 1, b
#define ANSELE2                          BANKMASK(ANSELE), 2, b
#define ANSELE3                          BANKMASK(ANSELE), 3, b
#define ANSELE4                          BANKMASK(ANSELE), 4, b
#define ANSELE5                          BANKMASK(ANSELE), 5, b
#define ANSELE6                          BANKMASK(ANSELE), 6, b
#define ANSELE7                          BANKMASK(ANSELE), 7, b
#define ANSELF0                          BANKMASK(ANSELF), 0, b
#define ANSELF1                          BANKMASK(ANSELF), 1, b
#define ANSELF2                          BANKMASK(ANSELF), 2, b
#define ANSELF3                          BANKMASK(ANSELF), 3, b
#define ANSELF4                          BANKMASK(ANSELF), 4, b
#define ANSELF5                          BANKMASK(ANSELF), 5, b
#define ANSELF6                          BANKMASK(ANSELF), 6, b
#define ANSELF7                          BANKMASK(ANSELF), 7, b
#define ANSELG0                          BANKMASK(ANSELG), 0, b
#define ANSELG1                          BANKMASK(ANSELG), 1, b
#define ANSELG2                          BANKMASK(ANSELG), 2, b
#define ANSELG3                          BANKMASK(ANSELG), 3, b
#define ANSELG4                          BANKMASK(ANSELG), 4, b
#define ANSELG6                          BANKMASK(ANSELG), 6, b
#define ANSELG7                          BANKMASK(ANSELG), 7, b
#define AS0E                             BANKMASK(CWG1AS1), 0, b
#define AS1E                             BANKMASK(CWG1AS1), 1, b
#define AS2E                             BANKMASK(CWG1AS1), 2, b
#define AS3E                             BANKMASK(CWG1AS1), 3, b
#define AS4E                             BANKMASK(CWG1AS1), 4, b
#define AS5E                             BANKMASK(CWG1AS1), 5, b
#define AS6E                             BANKMASK(CWG1AS1), 6, b
#define AS7E                             BANKMASK(CWG1AS1), 7, b
#define BCL1IE                           BANKMASK(PIE3), 1, b
#define BCL1IF                           BANKMASK(PIR3), 1, b
#define BCL1IP                           BANKMASK(IPR3), 1, b
#define BCL2IE                           BANKMASK(PIE3), 3, b
#define BCL2IF                           BANKMASK(PIR3), 3, b
#define BCL2IP                           BANKMASK(IPR3), 3, b
#define BF1                              BANKMASK(SSP1STAT), 0, a
#define BF2                              BANKMASK(SSP2STAT), 0, b
#define BOR                              BANKMASK(PCON0), 0, a
#define BORRDY                           BANKMASK(BORCON), 0, b
#define BRG161                           BANKMASK(BAUD1CON), 3, a
#define BRG162                           BANKMASK(BAUD2CON), 3, b
#define BRGH1                            BANKMASK(TX1STA), 2, a
#define C1EN                             BANKMASK(CM1CON0), 7, b
#define C1HYS                            BANKMASK(CM1CON0), 1, b
#define C1IE                             BANKMASK(PIE2), 0, b
#define C1IF                             BANKMASK(PIR2), 0, b
#define C1INTN                           BANKMASK(CM1CON1), 0, b
#define C1INTP                           BANKMASK(CM1CON1), 1, b
#define C1IP                             BANKMASK(IPR2), 0, b
#define C1NCH0                           BANKMASK(CM1NCH), 0, b
#define C1NCH1                           BANKMASK(CM1NCH), 1, b
#define C1NCH2                           BANKMASK(CM1NCH), 2, b
#define C1OUT                            BANKMASK(CM1CON0), 6, b
#define C1OUTF                           BANKMASK(PORTF), 2, a
#define C1PCH0                           BANKMASK(CM1PCH), 0, b
#define C1PCH1                           BANKMASK(CM1PCH), 1, b
#define C1PCH2                           BANKMASK(CM1PCH), 2, b
#define C1POL                            BANKMASK(CM1CON0), 4, b
#define C1SYNC                           BANKMASK(CM1CON0), 0, b
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, a
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, a
#define C2EN                             BANKMASK(CM2CON0), 7, b
#define C2HYS                            BANKMASK(CM2CON0), 1, b
#define C2IE                             BANKMASK(PIE2), 1, b
#define C2IF                             BANKMASK(PIR2), 1, b
#define C2INTN                           BANKMASK(CM2CON1), 0, b
#define C2INTP                           BANKMASK(CM2CON1), 1, b
#define C2IP                             BANKMASK(IPR2), 1, b
#define C2NCH0                           BANKMASK(CM2NCH), 0, b
#define C2NCH1                           BANKMASK(CM2NCH), 1, b
#define C2NCH2                           BANKMASK(CM2NCH), 2, b
#define C2OUT                            BANKMASK(CM2CON0), 6, b
#define C2OUTF                           BANKMASK(PORTF), 1, a
#define C2PCH0                           BANKMASK(CM2PCH), 0, b
#define C2PCH1                           BANKMASK(CM2PCH), 1, b
#define C2PCH2                           BANKMASK(CM2PCH), 2, b
#define C2POL                            BANKMASK(CM2CON0), 4, b
#define C2SYNC                           BANKMASK(CM2CON0), 0, b
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2, a
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3, a
#define C3EN                             BANKMASK(CM3CON0), 7, b
#define C3HYS                            BANKMASK(CM3CON0), 1, b
#define C3IE                             BANKMASK(PIE2), 2, b
#define C3IF                             BANKMASK(PIR2), 2, b
#define C3INTN                           BANKMASK(CM3CON1), 0, b
#define C3INTP                           BANKMASK(CM3CON1), 1, b
#define C3IP                             BANKMASK(IPR2), 2, b
#define C3NCH0                           BANKMASK(CM3NCH), 0, b
#define C3NCH1                           BANKMASK(CM3NCH), 1, b
#define C3NCH2                           BANKMASK(CM3NCH), 2, b
#define C3OUT                            BANKMASK(CM3CON0), 6, b
#define C3OUTG                           BANKMASK(PORTG), 1, a
#define C3PCH0                           BANKMASK(CM3PCH), 0, b
#define C3PCH1                           BANKMASK(CM3PCH), 1, b
#define C3PCH2                           BANKMASK(CM3PCH), 2, b
#define C3POL                            BANKMASK(CM3CON0), 4, b
#define C3SYNC                           BANKMASK(CM3CON0), 0, b
#define C3TSEL0                          BANKMASK(CCPTMRS0), 4, a
#define C3TSEL1                          BANKMASK(CCPTMRS0), 5, a
#define C4TSEL0                          BANKMASK(CCPTMRS0), 6, a
#define C4TSEL1                          BANKMASK(CCPTMRS0), 7, a
#define C5TSEL0                          BANKMASK(CCPTMRS1), 0, a
#define C5TSEL1                          BANKMASK(CCPTMRS1), 1, a
#define CAL01                            BANKMASK(TMR1L), 0, a
#define CAL03                            BANKMASK(TMR3L), 0, a
#define CAL05                            BANKMASK(TMR5L), 0, a
#define CAL07                            BANKMASK(TMR7L), 0, b
#define CAL11                            BANKMASK(TMR1L), 1, a
#define CAL13                            BANKMASK(TMR3L), 1, a
#define CAL15                            BANKMASK(TMR5L), 1, a
#define CAL17                            BANKMASK(TMR7L), 1, b
#define CAL21                            BANKMASK(TMR1L), 2, a
#define CAL23                            BANKMASK(TMR3L), 2, a
#define CAL25                            BANKMASK(TMR5L), 2, a
#define CAL27                            BANKMASK(TMR7L), 2, b
#define CAL31                            BANKMASK(TMR1L), 3, a
#define CAL33                            BANKMASK(TMR3L), 3, a
#define CAL35                            BANKMASK(TMR5L), 3, a
#define CAL37                            BANKMASK(TMR7L), 3, b
#define CAL41                            BANKMASK(TMR1L), 4, a
#define CAL43                            BANKMASK(TMR3L), 4, a
#define CAL45                            BANKMASK(TMR5L), 4, a
#define CAL47                            BANKMASK(TMR7L), 4, b
#define CAL51                            BANKMASK(TMR1L), 5, a
#define CAL53                            BANKMASK(TMR3L), 5, a
#define CAL55                            BANKMASK(TMR5L), 5, a
#define CAL57                            BANKMASK(TMR7L), 5, b
#define CAL61                            BANKMASK(TMR1L), 6, a
#define CAL63                            BANKMASK(TMR3L), 6, a
#define CAL65                            BANKMASK(TMR5L), 6, a
#define CAL67                            BANKMASK(TMR7L), 6, b
#define CAL71                            BANKMASK(TMR1L), 7, a
#define CAL73                            BANKMASK(TMR3L), 7, a
#define CAL75                            BANKMASK(TMR5L), 7, a
#define CAL77                            BANKMASK(TMR7L), 7, b
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCH05                            BANKMASK(IPR5), 0, b
#define CCH15                            BANKMASK(IPR5), 1, b
#define CCIP3IP                          BANKMASK(IPR4), 0, b
#define CCP10                            BANKMASK(PORTE), 2, a
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0, a
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1, a
#define CCP1EN                           BANKMASK(CCP1CON), 7, a
#define CCP1FMT                          BANKMASK(CCP1CON), 4, a
#define CCP1IE                           BANKMASK(PIE7), 0, b
#define CCP1IF                           BANKMASK(PIR7), 0, b
#define CCP1IP                           BANKMASK(IPR7), 0, b
#define CCP1MD                           BANKMASK(PMD4), 0, b
#define CCP1MODE0                        BANKMASK(CCP1CON), 0, a
#define CCP1MODE1                        BANKMASK(CCP1CON), 1, a
#define CCP1MODE2                        BANKMASK(CCP1CON), 2, a
#define CCP1MODE3                        BANKMASK(CCP1CON), 3, a
#define CCP1OUT                          BANKMASK(CCP1CON), 5, a
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0, b
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1, b
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2, b
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3, b
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4, b
#define CCP1PPS5                         BANKMASK(CCP1PPS), 5, b
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0, a
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1, a
#define CCP2E                            BANKMASK(PORTE), 7, a
#define CCP2EN                           BANKMASK(CCP2CON), 7, a
#define CCP2FMT                          BANKMASK(CCP2CON), 4, a
#define CCP2IE                           BANKMASK(PIE7), 1, b
#define CCP2IF                           BANKMASK(PIR7), 1, b
#define CCP2IP                           BANKMASK(IPR7), 1, b
#define CCP2MD                           BANKMASK(PMD4), 1, b
#define CCP2MODE0                        BANKMASK(CCP2CON), 0, a
#define CCP2MODE1                        BANKMASK(CCP2CON), 1, a
#define CCP2MODE2                        BANKMASK(CCP2CON), 2, a
#define CCP2MODE3                        BANKMASK(CCP2CON), 3, a
#define CCP2OUT                          BANKMASK(CCP2CON), 5, a
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0, b
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1, b
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2, b
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3, b
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4, b
#define CCP2PPS5                         BANKMASK(CCP2PPS), 5, b
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP3CTS0                         BANKMASK(CCP3CAP), 0, b
#define CCP3CTS1                         BANKMASK(CCP3CAP), 1, b
#define CCP3CTS2                         BANKMASK(CCP3CAP), 2, b
#define CCP3CTS3                         BANKMASK(CCP3CAP), 3, b
#define CCP3CTS4                         BANKMASK(CCP3CAP), 4, b
#define CCP3CTS5                         BANKMASK(CCP3CAP), 5, b
#define CCP3CTS6                         BANKMASK(CCP3CAP), 6, b
#define CCP3CTS7                         BANKMASK(CCP3CAP), 7, b
#define CCP3EN                           BANKMASK(CCP3CON), 7, b
#define CCP3FMT                          BANKMASK(CCP3CON), 4, b
#define CCP3IE                           BANKMASK(PIE7), 2, b
#define CCP3IF                           BANKMASK(PIR7), 2, b
#define CCP3IP                           BANKMASK(IPR7), 2, b
#define CCP3MD                           BANKMASK(PMD4), 2, b
#define CCP3MODE0                        BANKMASK(CCP3CON), 0, b
#define CCP3MODE1                        BANKMASK(CCP3CON), 1, b
#define CCP3MODE2                        BANKMASK(CCP3CON), 2, b
#define CCP3MODE3                        BANKMASK(CCP3CON), 3, b
#define CCP3OE                           BANKMASK(CCP3CON), 6, b
#define CCP3OUT                          BANKMASK(CCP3CON), 5, b
#define CCP3PPS0                         BANKMASK(CCP3PPS), 0, b
#define CCP3PPS1                         BANKMASK(CCP3PPS), 1, b
#define CCP3PPS2                         BANKMASK(CCP3PPS), 2, b
#define CCP3PPS3                         BANKMASK(CCP3PPS), 3, b
#define CCP3PPS4                         BANKMASK(CCP3PPS), 4, b
#define CCP3PPS5                         BANKMASK(CCP3PPS), 5, b
#define CCP4CTS0                         BANKMASK(CCP4CAP), 0, b
#define CCP4CTS1                         BANKMASK(CCP4CAP), 1, b
#define CCP4CTS2                         BANKMASK(CCP4CAP), 2, b
#define CCP4CTS3                         BANKMASK(CCP4CAP), 3, b
#define CCP4CTS4                         BANKMASK(CCP4CAP), 4, b
#define CCP4CTS5                         BANKMASK(CCP4CAP), 5, b
#define CCP4CTS6                         BANKMASK(CCP4CAP), 6, b
#define CCP4CTS7                         BANKMASK(CCP4CAP), 7, b
#define CCP4EN                           BANKMASK(CCP4CON), 7, b
#define CCP4FMT                          BANKMASK(CCP4CON), 4, b
#define CCP4IE                           BANKMASK(PIE7), 3, b
#define CCP4IF                           BANKMASK(PIR7), 3, b
#define CCP4IP                           BANKMASK(IPR7), 3, b
#define CCP4MD                           BANKMASK(PMD4), 3, b
#define CCP4MODE0                        BANKMASK(CCP4CON), 0, b
#define CCP4MODE1                        BANKMASK(CCP4CON), 1, b
#define CCP4MODE2                        BANKMASK(CCP4CON), 2, b
#define CCP4MODE3                        BANKMASK(CCP4CON), 3, b
#define CCP4OE                           BANKMASK(CCP4CON), 6, b
#define CCP4OUT                          BANKMASK(CCP4CON), 5, b
#define CCP4PPS0                         BANKMASK(CCP4PPS), 0, b
#define CCP4PPS1                         BANKMASK(CCP4PPS), 1, b
#define CCP4PPS2                         BANKMASK(CCP4PPS), 2, b
#define CCP4PPS3                         BANKMASK(CCP4PPS), 3, b
#define CCP4PPS4                         BANKMASK(CCP4PPS), 4, b
#define CCP4PPS5                         BANKMASK(CCP4PPS), 5, b
#define CCP5CTS0                         BANKMASK(CCP5CAP), 0, b
#define CCP5CTS1                         BANKMASK(CCP5CAP), 1, b
#define CCP5CTS2                         BANKMASK(CCP5CAP), 2, b
#define CCP5CTS3                         BANKMASK(CCP5CAP), 3, b
#define CCP5CTS4                         BANKMASK(CCP5CAP), 4, b
#define CCP5CTS5                         BANKMASK(CCP5CAP), 5, b
#define CCP5CTS6                         BANKMASK(CCP5CAP), 6, b
#define CCP5CTS7                         BANKMASK(CCP5CAP), 7, b
#define CCP5EN                           BANKMASK(CCP5CON), 7, b
#define CCP5FMT                          BANKMASK(CCP5CON), 4, b
#define CCP5IE                           BANKMASK(PIE7), 4, b
#define CCP5IF                           BANKMASK(PIR7), 4, b
#define CCP5IP                           BANKMASK(IPR7), 4, b
#define CCP5MD                           BANKMASK(PMD4), 4, b
#define CCP5MODE0                        BANKMASK(CCP5CON), 0, b
#define CCP5MODE1                        BANKMASK(CCP5CON), 1, b
#define CCP5MODE2                        BANKMASK(CCP5CON), 2, b
#define CCP5MODE3                        BANKMASK(CCP5CON), 3, b
#define CCP5OE                           BANKMASK(CCP5CON), 6, b
#define CCP5OUT                          BANKMASK(CCP5CON), 5, b
#define CCP5PPS0                         BANKMASK(CCP5PPS), 0, b
#define CCP5PPS1                         BANKMASK(CCP5PPS), 1, b
#define CCP5PPS2                         BANKMASK(CCP5PPS), 2, b
#define CCP5PPS3                         BANKMASK(CCP5PPS), 3, b
#define CCP5PPS4                         BANKMASK(CCP5PPS), 4, b
#define CCP5PPS5                         BANKMASK(CCP5PPS), 5, b
#define CCP6E                            BANKMASK(PORTE), 6, a
#define CCP7E                            BANKMASK(PORTE), 5, a
#define CCP8E                            BANKMASK(PORTE), 4, a
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CDAFVR0                          BANKMASK(FVRCON), 2, b
#define CDAFVR1                          BANKMASK(FVRCON), 3, b
#define CDIV0                            BANKMASK(OSCCON2), 0, b
#define CDIV1                            BANKMASK(OSCCON2), 1, b
#define CDIV2                            BANKMASK(OSCCON2), 2, b
#define CDIV3                            BANKMASK(OSCCON2), 3, b
#define CHPOL                            BANKMASK(MDCON1), 5, b
#define CHS0                             BANKMASK(MDCARH), 0, b
#define CHS1                             BANKMASK(MDCARH), 1, b
#define CHS2                             BANKMASK(MDCARH), 2, b
#define CHS3                             BANKMASK(MDCARH), 3, b
#define CHSYNC                           BANKMASK(MDCON1), 4, b
#define CKE1                             BANKMASK(SSP1STAT), 6, a
#define CKE2                             BANKMASK(SSP2STAT), 6, b
#define CKP1                             BANKMASK(SSP1CON1), 4, a
#define CKP2                             BANKMASK(SSP2CON1), 4, b
#define CKTXP                            BANKMASK(BAUD1CON), 4, a
#define CLK0                             BANKMASK(CLKRCLK), 0, b
#define CLK1                             BANKMASK(CLKRCLK), 1, b
#define CLK2                             BANKMASK(CLKRCLK), 2, b
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0, b
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1, b
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2, b
#define CLKRDC0                          BANKMASK(CLKRCON), 3, b
#define CLKRDC1                          BANKMASK(CLKRCON), 4, b
#define CLKRDIV0                         BANKMASK(CLKRCON), 0, b
#define CLKRDIV1                         BANKMASK(CLKRCON), 1, b
#define CLKRDIV2                         BANKMASK(CLKRCON), 2, b
#define CLKREN                           BANKMASK(CLKRCON), 7, b
#define CLKRMD                           BANKMASK(PMD0), 1, b
#define CLPOL                            BANKMASK(MDCON1), 1, b
#define CLS0                             BANKMASK(MDCARL), 0, b
#define CLS1                             BANKMASK(MDCARL), 1, b
#define CLS2                             BANKMASK(MDCARL), 2, b
#define CLS3                             BANKMASK(MDCARL), 3, b
#define CLSYNC                           BANKMASK(MDCON1), 0, b
#define CMIE                             BANKMASK(PIE2), 6, b
#define CMIF                             BANKMASK(PIR2), 6, b
#define CMIP                             BANKMASK(IPR2), 6, b
#define CMP1MD                           BANKMASK(PMD3), 1, b
#define CMP2MD                           BANKMASK(PMD3), 2, b
#define CMP3MD                           BANKMASK(PMD3), 3, b
#define COSC0                            BANKMASK(OSCCON2), 4, b
#define COSC1                            BANKMASK(OSCCON2), 5, b
#define COSC2                            BANKMASK(OSCCON2), 6, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE8), 6, b
#define CRCIF                            BANKMASK(PIR8), 6, b
#define CRCIP                            BANKMASK(IPR8), 6, b
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CSRC1                            BANKMASK(TX1STA), 7, a
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE1), 6, b
#define CSWIF                            BANKMASK(PIR1), 6, b
#define CSWIP                            BANKMASK(IPR1), 6, b
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE8), 0, b
#define CWG1IF                           BANKMASK(PIR8), 0, b
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
#define CWG1INPPS0                       BANKMASK(CWG1PPS), 0, b
#define CWG1INPPS1                       BANKMASK(CWG1PPS), 1, b
#define CWG1INPPS2                       BANKMASK(CWG1PPS), 2, b
#define CWG1INPPS3                       BANKMASK(CWG1PPS), 3, b
#define CWG1INPPS4                       BANKMASK(CWG1PPS), 4, b
#define CWG1IP                           BANKMASK(IPR8), 0, b
#define CWG1ISM0                         BANKMASK(CWG1ISM), 0, b
#define CWG1ISM1                         BANKMASK(CWG1ISM), 1, b
#define CWG1ISM2                         BANKMASK(CWG1ISM), 2, b
#define CWG1LD                           BANKMASK(CWG1CON0), 6, b
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2, b
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3, b
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5, b
#define CWG1MD                           BANKMASK(PMD2), 5, b
